MaJerle/stm32-usart-uart-dma-rx-tx/drivers/STM32C5xx_drivers/hal/stm32c5xx_hal_flash.c
/**
  **********************************************************************************************************************
  * @file    stm32c5xx_hal_flash.c
  * @brief   This file provides FLASH memory services.
  **********************************************************************************************************************
  * @attention
  *
  * Copyright (c) 2026 STMicroelectronics.
  * All rights reserved.
  *
  * This software is licensed under terms that can be found in the LICENSE file
  * in the root directory of this software component.
  * If no LICENSE file comes with this software, it is provided AS-IS.
  *
  **********************************************************************************************************************
  */

/* Includes ----------------------------------------------------------------------------------------------------------*/
#include "stm32_hal.h"

/** @addtogroup STM32C5xx_HAL_Driver
  * @{
  */

#if defined (FLASH)
#if defined (USE_HAL_FLASH_MODULE) && (USE_HAL_FLASH_MODULE == 1)

/** @addtogroup FLASH
  * @{
  */
/** @defgroup FLASH_Introduction FLASH Introduction
  * @{

  The FLASH IO Hardware Abstraction Layer (HAL) provides high-level, user-friendly APIs for managing
  non-volatile memory (FLASH) operations on STM32 microcontrollers.

  This layer offers firmware functions to handle key FLASH functionalities, including:

    - Initialization and de-initialization of FLASH handling.
    - Programming operations across different FLASH memory areas.
    - Management of operation completion and error interrupt requests.
    - Retrieval of FLASH memory topology and configuration information.

  The abstraction provided by this layer ensures portability and simplifies application development
  across various STM32 microcontroller series.

  */
/**
  * @}
  */

/** @defgroup FLASH_How_To_Use FLASH How To Use
  * @{

The Flash memory interface manages CPU AHB C-Bus accesses to the Flash memory. It implements the erase and program Flash
memory operations and the read and write protection mechanisms.

# FLASH main features

The FLASH memory organization is based on a main area, an EDATA area and an information block.
  - The main flash memory block organized as two banks of up to 512 Kbytes each containing up to 64 pages of 8 Kbytes.
  - The EDATA memory block can be configured
    - to extend the user area, with two banks of 32 Kbytes each containing 16 pages of 2 Kbytes.
    - or to offer data flash area, with two banks of 24 Kbytes each containing 16 pages of 1.5 Kbytes.
  - The information block contains:
    - 32 Kbytes for system memory. It contains the bootloader that is used to reprogram the flash memory.
    - 32 Kbytes immutable secure area containing the root security services (RSS and RSS library).
    - 512 bytes OTP (one-time programmable). The OTP data cannot be erased and can be written only once.
    - Option bytes for user configuration. The FLASH_ITF module provides option bytes configuration functions.

## Programming operation
  - The flash memory program operation can be performed 128, 64, 32, 16 or 8 bits at a time within the flash user memory
    areas.
  - The flash memory program operation can be performed 32 or 16 bits at a time within the flash data and OTP memory
    areas.
  - Programming in a previously programmed address is not allowed except if the data to write is full zero.

## Erasing operation
  - The flash memory erase operation can be performed at page level.
  - The flash memory erase operation can be performed at bank level.
  - The flash memory erase operation can be performed on the whole flash memory.

# How to use the FLASH HAL module driver

## Initialization and De-initialization functions

- For a given instance, use the HAL_FLASH_Init() function to initialize the FLASH handle and associate the physical
  instance.
- Use the HAL_FLASH_DeInit() function to de-initialize FLASH. When called, the FLASH must be in reset.

## Configuration functions

- Use the HAL_FLASH_SetProgrammingMode() function to set the programming mode.
- Use the HAL_FLASH_GetProgrammingMode() function to get the programming mode.

## Process operation functions

### Polling mode operations
- Use the HAL_FLASH_ProgramByAddr() function to program by address any area of FLASH USER memory in polling mode.
- Use the HAL_FLASH_ProgramByAddrAdapt() function to program by address using adaptive width any area of FLASH USER
  memory in polling mode.
- Use the HAL_FLASH_OTP_ProgramByAddr() function to program by address any area of OTP area in polling mode.
- Use the HAL_FLASH_OTP_ProgramByAddrAdapt() function to program by address using adaptive width any area of OTP area in
  polling mode.
- Use the HAL_FLASH_EDATA_ProgramByAddr() function to program by address any area of FLASH EDATA memory in polling mode.
- Use the HAL_FLASH_EDATA_ProgramByAddrAdapt() function to program by address using adaptive width any area of FLASH
  EDATA memory in polling mode.
- Use the HAL_FLASH_EraseByAddr() function to erase by address any area of FLASH USER memory in polling mode.
- Use the HAL_FLASH_EDATA_EraseByAddr() function to erase by address any area of FLASH EDATA memory in polling mode.
- Use the HAL_FLASH_ErasePage() function to erase a specific set of pages of FLASH USER memory in polling mode.
- Use the HAL_FLASH_EDATA_ErasePage() function to erase a specific set of pages of FLASH EDATA memory in polling mode.
- Use the HAL_FLASH_EraseBank() function to erase a specific bank of FLASH memory (USER and EDATA) in polling mode.
- Use the HAL_FLASH_MassErase() function to erase all the FLASH memory (USER and EDATA) in polling mode.

### Interrupt mode operations
- Configure the FLASH interrupt priority using HAL_CORTEX_NVIC_SetPriority() function
- Enable the FLASH IRQ handler using HAL_CORTEX_NVIC_EnableIRQ() function

- Use the HAL_FLASH_ProgramByAddr_IT() function to program by address any area of FLASH USER memory in interrupt mode.
- Use the HAL_FLASH_ProgramByAddrAdapt_IT() function to program by address using adaptive width any area of FLASH USER
  memory in interrupt mode.
- Use the HAL_FLASH_OTP_ProgramByAddr_IT() function to program by address any area of OTP area in interrupt mode.
- Use the HAL_FLASH_OTP_ProgramByAddrAdapt_IT() function to program by address using adaptive width any area of OTP area
  in interrupt mode.
- Use the HAL_FLASH_EDATA_ProgramByAddr_IT() function to program by address any area of FLASH EDATA memory in interrupt
  mode.
- Use the HAL_FLASH_EDATA_ProgramByAddrAdapt_IT() function to program by address using adaptive width any area of FLASH
  EDATA memory in interrupt mode.
- Use the HAL_FLASH_EraseByAddr_IT() function to erase by address the FLASH USER memory in interrupt mode.
- Use the HAL_FLASH_EDATA_EraseByAddr_IT() function to erase by address the FLASH EDATA memory in interrupt mode.
- Use the HAL_FLASH_ErasePage_IT() function to erase by page the FLASH USER memory in interrupt mode.
- Use the HAL_FLASH_EDATA_ErasePage_IT() function to erase by page the FLASH EDATA memory in interrupt mode.
- Use the HAL_FLASH_EraseBank_IT() function to erase a bank of FLASH memory (USER and EDATA) in interrupt mode.
- Use the HAL_FLASH_MassErase_IT() function to erase all the FLASH memory (USER and EDATA) in interrupt mode.
- Use the HAL_FLASH_IRQHandler() function called under FLASH_IRQHandler interrupt subroutine to handle any FLASH
  interrupt.
- Use the HAL_FLASH_ProgramByAddr_IRQHandler() function called under FLASH_IRQHandler interrupt subroutine to handle
  any FLASH program interrupt.
- Use the HAL_FLASH_EraseByAddr_IRQHandler() function called under FLASH_IRQHandler interrupt subroutine to handle
  any FLASH erase by address interrupt.
- Use the HAL_FLASH_ErasePage_IRQHandler() function called under FLASH_IRQHandler interrupt subroutine to handle
  any FLASH erase page interrupt.
- Use the HAL_FLASH_EraseBank_IRQHandler() function called under FLASH_IRQHandler interrupt subroutine to handle
  any FLASH erase bank interrupt.
- Use the HAL_FLASH_MassErase_IRQHandler() function called under FLASH_IRQHandler interrupt subroutine to handle
  any FLASH mass erase interrupt.
- Use the HAL_FLASH_ECC_IRQHandler() function called under FLASH_IRQHandler interrupt subroutine to handle
  any ECC single error interrupt.
- Use the HAL_FLASH_NMI_IRQHandler() function called under NMI_Handler interrupt subroutine to handle any NMI FLASH
  interrupt.

