MaJerle/stm32-usart-uart-dma-rx-tx/drivers/STM32C5xx_drivers/hal/stm32c5xx_hal_flash.c
## Callback registration

When the compilation flag USE_HAL_FLASH_REGISTER_CALLBACKS is set to 1, the following functions allow to register
the different FLASH callbacks:
- Use the HAL_FLASH_RegisterProgramCpltCallback() function to register the FLASH program complete callback.
- Use the HAL_FLASH_RegisterEraseByAddrCpltCallback() function to register the FLASH erase by address complete callback.
- Use the HAL_FLASH_RegisterErasePageCpltCallback() function to register the FLASH erase by page complete callback.
- Use the HAL_FLASH_RegisterEraseBankCpltCallback() function to register the FLASH bank erase complete callback.
- Use the HAL_FLASH_RegisterMassEraseCpltCallback() function to register the FLASH mass erase complete callback.
- Use the HAL_FLASH_RegisterErrorCallback() function to register the FLASH error callback.
- Use the HAL_FLASH_RegisterECCErrorCallback() function to register the FLASH ECC error callback.

When the compilation flag USE_HAL_FLASH_REGISTER_CALLBACKS is undefined or set to 0, the callback registration feature
is not available and all callbacks are set to the following weak functions:
- The HAL_FLASH_ProgramCpltCallback() function for the program complete callback.
- The HAL_FLASH_EraseByAddrCpltCallback() function for the erase by address complete callback.
- The HAL_FLASH_ErasePageCpltCallback() function for the erase by page complete callback.
- The HAL_FLASH_EraseBankCpltCallback() function for the erase bank complete callback.
- The HAL_FLASH_MassEraseCpltCallback() function for the mass erase complete callback.
- The HAL_FLASH_ErrorCallback() function for the error callback.
- The HAL_FLASH_ECC_ErrorCallback() function for the ECC error callback.

These weak functions can be redefined within user application if the callbacks are needed.

## Status functions

- Use the HAL_FLASH_GetCurrentOperation() function to get the current flash operation.
- Use the HAL_FLASH_GetCurrentProgrammedAddr() function to get the currently being programmed flash address.
- Use the HAL_FLASH_GetCurrentErasedAddr() function to get the currently being erased flash address.
- Use the HAL_FLASH_GetCurrentErasedPage() function to get the currently being erased flash page.
- Use the HAL_FLASH_GetInterruptedByResetOperationInfo() function to get the interrupted flash operation information.
- Use the HAL_FLASH_GetInfo() function to get the FLASH information.
- Use the HAL_FLASH_GetSizeByte() function to get the FLASH total size.
- Use the HAL_FLASH_GetBankNbr() function to get the FLASH number of banks.
- Use the HAL_FLASH_GetBankSizeByte() function to get the FLASH bank size.
- Use the HAL_FLASH_GetUserFlashSizeByte() function to get the FLASH USER area size within a bank.
- Use the HAL_FLASH_EDATA_GetSizeByte() function to get the FLASH EDATA area size within a bank.
- Use the HAL_FLASH_GetExtUserFlashSizeByte() function to get the FLASH Extended USER area size within a bank.
- Use the HAL_FLASH_GetUserFlashPageNbr() function to get the number of pages in FLASH USER area.
- Use the HAL_FLASH_EDATA_GetPageNbr() function to get the number of pages in FLASH EDATA area.
- Use the HAL_FLASH_GetExtUserFlashPageNbr() function to get the number of pages in FLASH extended USER area.
- Use the HAL_FLASH_GetUserFlashPageSizeByte() function to get the size of a given page in FLASH USER area.
- Use the HAL_FLASH_EDATA_GetPageSizeByte() function to get the size of a given page in FLASH EDATA area.
- Use the HAL_FLASH_GetExtUserFlashPageSizeByte() function to get the size of a given page in FLASH extended USER area.
- Use the HAL_FLASH_GetUserFlashAddrOffset() function to get the address offset of a specific page in FLASH USER area.
- Use the HAL_FLASH_EDATA_GetAddrOffset() function to get the address offset of a specific page in FLASH EDATA area.
- Use the HAL_FLASH_GetExtUserFlashAddrOffset() function to get the address offset of a specific page in FLASH extended
  USER area. The offset is computed from the beginning of the FLASH extended USER area.
- Use the HAL_FLASH_ECC_GetInfo() function to get the FLASH ECC information.
- Use the HAL_FLASH_GetInstance() function to get the HAL FLASH instance.
- Use the HAL_FLASH_GetLLInstance() function to get the hardware FLASH instance.
- Use the HAL_FLASH_GetState() function to get the flash global state.
- Use the HAL_FLASH_GetLastErrorCodes() function to get the last error codes.
- Use the HAL_FLASH_SetUserData() function to set user data within the FLASH handle.
- Use the HAL_FLASH_GetUserData() function to get the user data from the FLASH handle.
  */
/**
  * @}
  */

/** @defgroup FLASH_Configuration_Table FLASH Configuration Table
  * @{
## Configuration inside the FLASH driver

Configuration defines           | Description   | Default value   | Note                                               |
--------------------------------| ------------- | --------------- | -------------------------------------------------- |
PRODUCT                         |from IDE       |        NA       | The selected device (ex STM32C5xx).                |
USE_HAL_FLASH_MODULE            |from hal_conf.h|        1        | Enables the HAL FLASH module.                      |
USE_ASSERT_DBG_PARAM            |from IDE       |      None       | Enables assert check parameters.                   |
USE_ASSERT_DBG_STATE            |from IDE       |      None       | Enables assert check states.                       |
USE_HAL_CHECK_PARAM             |from hal_conf.h|        0        | Enables run-time parameter checks.                 |
USE_HAL_CHECK_PROCESS_STATE     |from hal_conf.h|        0        | Enables load and store exclusive checks.           |
USE_HAL_FLASH_REGISTER_CALLBACKS|from hal_conf.h|        0        | Enables callback registration for FLASH.           |
USE_HAL_FLASH_CLK_ENABLE_MODEL  |from hal_conf.h|HAL_CLK_ENABLE_NO| Enables the clock model for the FLASH.             |
USE_HAL_FLASH_GET_LAST_ERRORS   |from hal_conf.h|        0        | Enables the error code mechanism.                  |
USE_HAL_FLASH_USER_DATA         |from hal_conf.h|        0        | Enables user data.                                 |
USE_HAL_FLASH_PROGRAM_BY_ADDR   |from hal_conf.h|        1        | Enables program by address feature APIs.           |
USE_HAL_FLASH_ERASE_BY_ADDR     |from hal_conf.h|        1        | Enables erase by address feature APIs.             |
USE_HAL_FLASH_ERASE_PAGE        |from hal_conf.h|        1        | Enables erase by page feature APIs.                |
USE_HAL_FLASH_ERASE_BANK        |from hal_conf.h|        1        | Enables erase by bank feature APIs.                |
USE_HAL_FLASH_MASS_ERASE        |from hal_conf.h|        1        | Enables mass erase feature APIs.                   |
USE_HAL_FLASH_ECC               |from hal_conf.h|        1        | Enables ECC error handling APIs.                   |
USE_HAL_FLASH_OB_EDATA          |from hal_conf.h|        0    | Enables EDATA APIs. Value must be equal to EDATA_EN OB.|
  */
/**
  * @}
  */

/* Private Constants -------------------------------------------------------------------------------------------------*/
/** @defgroup FLASH_Private_Constants FLASH Private Constants
  * @{
  */

