MaJerle/stm32-usart-uart-dma-rx-tx/drivers/STM32C5xx_drivers/hal/stm32c5xx_hal_flash.c
#define FLASH_OPERATION_MAX_TIMEOUT              1000U /*!< FLASH Operation maximum timeout in ms           */
#define FLASH_PROGRAM_OPERATION_QUADWORD_TIMEOUT 1U    /*!< FLASH Program operation quad-word timeout in ms */
#define FLASH_ERASE_PAGE_OPERATION_TIMEOUT       10U   /*!< FLASH Erase page operation timeout in ms        */

#define FLASH_QUADWORD_SIZE_BYTE   16U /*!< FLASH quad-word size in bytes   */
#define FLASH_DOUBLEWORD_SIZE_BYTE 8U  /*!< FLASH double-word size in bytes */
#define FLASH_WORD_SIZE_BYTE       4U  /*!< FLASH word size in bytes        */
#define FLASH_HALFWORD_SIZE_BYTE   2U  /*!< FLASH half-word size in bytes   */

#define FLASH_OTP_16BIT_OFFSET_BASE 0x200UL /*!< Base 16-bit offset of OTP area in the 16-bit interface address space */
#define FLASH_16BIT_ROW_SIZE        0x80UL  /*!< Size of a row in 16-bit interface units used for address mapping     */
#define FLASH_OTP_PAGE_SIZE         0x600UL /*!< FLASH OTP page size                                                  */

/**
  * @}
  */

/* Private Macros ----------------------------------------------------------------------------------------------------*/
/** @defgroup FLASH_Private_Macros FLASH Private Macros
  * @{
  */

/*! Macro to get the FLASH physical instance from the handle */
#define FLASH_GET_INSTANCE(hflash) ((FLASH_TypeDef *)((uint32_t)((hflash)->instance)))

/*! Macro to check the FLASH memory programming mode type */
#define IS_FLASH_PROGRAM_MODE_TYPE(mode) (((mode) == HAL_FLASH_PROGRAM_QUADWORD) \
                                          || ((mode) == HAL_FLASH_PROGRAM_DOUBLEWORD) \
                                          || ((mode) == HAL_FLASH_PROGRAM_WORD) \
                                          || ((mode) == HAL_FLASH_PROGRAM_HALFWORD) \
                                          || ((mode) == HAL_FLASH_PROGRAM_BYTE))


/*! Macro to check FLASH memory bank */
#define IS_FLASH_BANK(value) (((value) == HAL_FLASH_BANK_1) \
                              || ((value) == HAL_FLASH_BANK_2))

/*! Macro to check the FLASH user bank boundary cross */
#if defined(USE_HAL_FLASH_OB_EDATA) && (USE_HAL_FLASH_OB_EDATA == 1)
#define IS_FLASH_NO_USER_CROSS_BANK(addr, size) (((addr) < (FLASH_BASE + FLASH_BANK_SIZE)) \
                                                 ? (((addr) + (size)) \
                                                    <= (FLASH_BASE + FLASH_BANK_SIZE)) \
                                                 : (((addr) + (size)) \
                                                    <= (FLASH_BASE + FLASH_SIZE)))

#else
#define IS_FLASH_NO_USER_CROSS_BANK(addr, size) (((addr) < (FLASH_BASE + FLASH_SIZE)) \
                                                 ? (((addr) < (FLASH_BASE + FLASH_BANK_SIZE)) \
                                                    ? (((addr) + (size)) \
                                                       <= (FLASH_BASE + FLASH_BANK_SIZE)) \
                                                    : (((addr) + (size)) \
                                                       <= (FLASH_BASE + FLASH_SIZE))) \
                                                 : (((addr) < (FLASH_EXT_USER_BASE + FLASH_EXT_USER_BANK_SIZE)) \
                                                    ? (((addr) + (size)) \
                                                       <= (FLASH_EXT_USER_BASE + FLASH_EXT_USER_BANK_SIZE)) \
                                                    : (((addr) + (size)) \
                                                       <= (FLASH_EXT_USER_BASE + FLASH_EXT_USER_SIZE))))
#endif /* USE_HAL_FLASH_OB_EDATA */

#if defined(USE_HAL_FLASH_OB_EDATA) && (USE_HAL_FLASH_OB_EDATA == 1)
/*! Macro to check the FLASH EDATA bank boundary cross */
#define IS_FLASH_NO_EDATA_CROSS_BANK(addr, size) (((addr) < (FLASH_EDATA_BASE + FLASH_EDATA_BANK_SIZE)) \
                                                  ? (((addr) + (size)) \
                                                     <= (FLASH_EDATA_BASE + FLASH_EDATA_BANK_SIZE)) \
                                                  : (((addr) + (size)) \
                                                     <= (FLASH_EDATA_BASE + FLASH_EDATA_SIZE)))

#endif /* USE_HAL_FLASH_OB_EDATA */
/*! Macro to check FLASH OTP memory address granularity */
#define IS_FLASH_OTP_ADDRESS(value) (((value) >= FLASH_OTP_BASE) && ((value) < (FLASH_OTP_BASE + FLASH_OTP_SIZE)) \
                                     && (((value) % FLASH_HALFWORD_SIZE_BYTE) == 0U))

/*! Macro to check FLASH OTP memory size_byte in range */
#define IS_FLASH_OTP_SIZE_IN_RANGE(otp_addr, size_byte) (((otp_addr) + (size_byte)) \
                                                         <= (FLASH_OTP_BASE + FLASH_OTP_SIZE))

/*! Macro to check FLASH memory start page and page number in range */
#define IS_FLASH_PAGE_IN_RANGE(page, page_nbr) (((page) + (page_nbr)) \
                                                <= (FLASH_PAGE_NB + FLASH_EDATA_PAGE_NB))

/*! Macro to get FLASH programming size */
#define FLASH_GET_PROGRAM_SIZE(mode) (((mode) == HAL_FLASH_PROGRAM_QUADWORD) ? FLASH_QUADWORD_SIZE_BYTE : \
                                      (((mode) == HAL_FLASH_PROGRAM_DOUBLEWORD) ? FLASH_DOUBLEWORD_SIZE_BYTE : \
                                       (((mode) == HAL_FLASH_PROGRAM_WORD) ? FLASH_WORD_SIZE_BYTE : \
                                        (((mode) == HAL_FLASH_PROGRAM_HALFWORD) ? FLASH_HALFWORD_SIZE_BYTE : 1U))))

/*! Macro to get the FLASH erase bank */
#define FLASH_GET_ERASE_BANK(bank) (((bank) == HAL_FLASH_BANK_1) ? LL_FLASH_ERASE_BANK_1 : LL_FLASH_ERASE_BANK_2)

/*! Macro to get FLASH memory erase area */
#define FLASH_GET_ERASE_AREA(page) (((page) < FLASH_PAGE_NB) \
                                    ? LL_FLASH_ERASE_USER_AREA : LL_FLASH_ERASE_EDATA_AREA)

/*! Macro to get FLASH memory erase area address */
#define FLASH_GET_ERASE_AREA_ADDR(addr) (((addr) < FLASH_EXT_USER_BASE) \
                                         ? LL_FLASH_ERASE_USER_AREA : LL_FLASH_ERASE_EDATA_AREA)

/*! Macro to get FLASH memory page index */
#define FLASH_GET_HW_PAGE_INDEX(page_index, max_page_index) \
  (((page_index) >= (max_page_index)) ? ((page_index) - (max_page_index)) : (page_index))


/**
  * @}
  */

/* Private Functions Prototypes --------------------------------------------------------------------------------------*/
/** @defgroup FLASH_Private_Functions FLASH Private Functions
  * @{
  */
#if (defined (USE_HAL_FLASH_PROGRAM_BY_ADDR) && (USE_HAL_FLASH_PROGRAM_BY_ADDR == 1)) \
    || (defined (USE_HAL_FLASH_ERASE_BY_ADDR) && (USE_HAL_FLASH_ERASE_BY_ADDR == 1)) \
    || (defined (USE_HAL_FLASH_ERASE_PAGE) && (USE_HAL_FLASH_ERASE_PAGE == 1)) \
    || (defined (USE_HAL_FLASH_ERASE_BANK) && (USE_HAL_FLASH_ERASE_BANK == 1)) \
    || (defined (USE_HAL_FLASH_MASS_ERASE) && (USE_HAL_FLASH_MASS_ERASE == 1))
static hal_status_t FLASH_IsReadyForOperation(hal_flash_handle_t *hflash);
#endif /* USE_HAL_FLASH_PROGRAM_BY_ADDR || USE_HAL_FLASH_ERASE_BY_ADDR || USE_HAL_FLASH_ERASE_PAGE
          || USE_HAL_FLASH_ERASE_BANK || USE_HAL_FLASH_MASS_ERASE */

static hal_status_t FLASH_WaitForEndOfOperation(hal_flash_handle_t *hflash, uint32_t timeout_ms);

#if defined (USE_HAL_FLASH_PROGRAM_BY_ADDR) && (USE_HAL_FLASH_PROGRAM_BY_ADDR == 1)
static hal_flash_program_unit_func_t FLASH_GetProgramUnitFunction(hal_flash_program_mode_t programming_mode);
static void         FLASH_UpdateAdaptiveProgMode(hal_flash_handle_t *hflash);
static hal_status_t FLASH_Program(hal_flash_handle_t *hflash, uint32_t flash_addr, const uint32_t *p_data,
                                  uint32_t size_byte, uint32_t timeout_ms);
static hal_status_t FLASH_Program_IT(hal_flash_handle_t *hflash, uint32_t flash_addr, const uint32_t *p_data,
                                     uint32_t size_byte);
static void         FLASH_ProgramByWord(hal_flash_handle_t *hflash);
static void         FLASH_ProgramByHalfWord(hal_flash_handle_t *hflash);
static void         FLASH_ProgramByByte(hal_flash_handle_t *hflash);
#endif /* USE_HAL_FLASH_PROGRAM_BY_ADDR */
#if defined (USE_HAL_FLASH_ERASE_BY_ADDR) && (USE_HAL_FLASH_ERASE_BY_ADDR == 1)
static uint32_t FLASH_GetPageSizeByAddr(uint32_t page_addr);
static uint32_t FLASH_GetPageIndexByAddr(uint32_t flash_addr);
static hal_status_t FLASH_EraseAddr(hal_flash_handle_t *hflash,
                                    uint32_t flash_addr,
                                    uint32_t size_byte,
                                    uint32_t page_size,
                                    uint32_t timeout_ms);
static hal_status_t FLASH_EraseAddr_IT(hal_flash_handle_t *hflash,
                                       uint32_t flash_addr,
                                       uint32_t size_byte);
#endif /* USE_HAL_FLASH_ERASE_BY_ADDR */
#if defined (USE_HAL_FLASH_ERASE_PAGE) && (USE_HAL_FLASH_ERASE_PAGE == 1)
static hal_status_t FLASH_ErasePage(hal_flash_handle_t *hflash,
                                    hal_flash_bank_t bank,
                                    uint32_t start_page,
                                    uint32_t page_nbr,
                                    uint32_t erase_area,
                                    uint32_t timeout_ms);
static hal_status_t FLASH_ErasePage_IT(hal_flash_handle_t *hflash,
                                       hal_flash_bank_t bank,
                                       uint32_t start_page,
                                       uint32_t page_nbr,
                                       uint32_t erase_area);
#endif /* USE_HAL_FLASH_ERASE_PAGE */

#if defined(USE_HAL_FLASH_GET_LAST_ERRORS) && (USE_HAL_FLASH_GET_LAST_ERRORS == 1)
static void FLASH_FillErrorCode(hal_flash_handle_t *hflash, uint32_t flags);
#endif /* USE_HAL_FLASH_GET_LAST_ERRORS */

