MaJerle/stm32-usart-uart-dma-rx-tx/drivers/STM32C5xx_drivers/hal/stm32c5xx_hal_flash.c
  hflash->is_adaptive_prog = 0U;

  return FLASH_Program(hflash, otp_addr, p_data, size_byte, timeout_ms);
}

/**
  * @brief  Program the OTP area at specified address in interrupt mode.
  * @param  hflash            Pointer to a @ref hal_flash_handle_t structure.
  * @param  otp_addr          OTP address.
  * @param  p_data            Pointer to the data to be programmed.
  * @param  size_byte         Size of the data to be programmed (in bytes).
  * @retval HAL_INVALID_PARAM Returned when an invalid input parameter selected.
  * @retval HAL_ERROR         Returned when the FLASH access registers locked or when the TrustZone enabled.
  * @retval HAL_BUSY          Returned when the FLASH is busy and cannot start a new programming operation.
  * @retval HAL_OK            Returned when the programming operation completes successfully.
  */
hal_status_t HAL_FLASH_OTP_ProgramByAddr_IT(hal_flash_handle_t *hflash,
                                            uint32_t otp_addr,
                                            const uint32_t *p_data,
                                            uint32_t size_byte)
{
  ASSERT_DBG_PARAM(hflash != NULL);
  ASSERT_DBG_PARAM(p_data != NULL);
  ASSERT_DBG_PARAM(IS_FLASH_OTP_ADDRESS(otp_addr));
  ASSERT_DBG_PARAM(IS_FLASH_OTP_SIZE_IN_RANGE(otp_addr, size_byte));
  ASSERT_DBG_PARAM((hflash->programming_mode == HAL_FLASH_PROGRAM_HALFWORD) \
                   || (hflash->programming_mode == HAL_FLASH_PROGRAM_WORD));
  ASSERT_DBG_PARAM((size_byte != 0U) && ((size_byte % FLASH_GET_PROGRAM_SIZE(hflash->programming_mode)) == 0U));
  ASSERT_DBG_STATE(hflash->global_state, (uint32_t)HAL_FLASH_STATE_IDLE);

#if defined(USE_HAL_CHECK_PARAM) && (USE_HAL_CHECK_PARAM == 1)
  if ((IS_FLASH_OTP_ADDRESS(otp_addr) == 0U) || (p_data == NULL))
  {
    return HAL_INVALID_PARAM;
  }

  if ((IS_FLASH_OTP_SIZE_IN_RANGE(otp_addr, size_byte) == 0U) || (size_byte == 0U))
  {
    return HAL_INVALID_PARAM;
  }
#endif /* USE_HAL_CHECK_PARAM */

  hflash->is_adaptive_prog = 0U;

  return FLASH_Program_IT(hflash, otp_addr, p_data, size_byte);
}

/**
  * @brief  Program the OTP area at specified address using adaptive width in polling mode.
  * @param  hflash            Pointer to a @ref hal_flash_handle_t structure.
  * @param  otp_addr          OTP address.
  * @param  p_data            Pointer to the data to be programmed.
  * @param  size_byte         Size of the data to be programmed (in bytes).
  * @param  timeout_ms        Timeout value for programming.
  * @note   The adaptive mode optimizes FLASH programming access based on the remaining data size,
  *         ignoring the programming mode selected by the HAL_FLASH_SetProgrammingMode() API.
  * @retval HAL_INVALID_PARAM Returned when an invalid input parameter selected.
  * @retval HAL_ERROR         Returned when the FLASH access registers locked or when the TrustZone enabled.
  * @retval HAL_TIMEOUT       Internal processing exceeded the timeout.
  * @retval HAL_BUSY          Returned when the FLASH is busy and cannot start a new programming operation.
  * @retval HAL_OK            Returned when the programming operation completes successfully.
  */
hal_status_t HAL_FLASH_OTP_ProgramByAddrAdapt(hal_flash_handle_t *hflash,
                                              uint32_t otp_addr,
                                              const uint32_t *p_data,
                                              uint32_t size_byte,
                                              uint32_t timeout_ms)
{
  ASSERT_DBG_PARAM(hflash != NULL);
  ASSERT_DBG_PARAM(p_data != NULL);
  ASSERT_DBG_PARAM(IS_FLASH_OTP_ADDRESS(otp_addr));
  ASSERT_DBG_PARAM(IS_FLASH_OTP_SIZE_IN_RANGE(otp_addr, size_byte));
  ASSERT_DBG_PARAM((size_byte != 0U) && ((size_byte % FLASH_HALFWORD_SIZE_BYTE) == 0U));
  ASSERT_DBG_STATE(hflash->global_state, (uint32_t)HAL_FLASH_STATE_IDLE);

#if defined(USE_HAL_CHECK_PARAM) && (USE_HAL_CHECK_PARAM == 1)
  if ((IS_FLASH_OTP_ADDRESS(otp_addr) == 0U) || (p_data == NULL))
  {
    return HAL_INVALID_PARAM;
  }

  if ((IS_FLASH_OTP_SIZE_IN_RANGE(otp_addr, size_byte) == 0U) || (size_byte == 0U))
  {
    return HAL_INVALID_PARAM;
  }
#endif /* USE_HAL_CHECK_PARAM */

  hflash->is_adaptive_prog = 1U;

  return FLASH_Program(hflash, otp_addr, p_data, size_byte, timeout_ms);
}

/**
  * @brief  Program the OTP area at specified address using adaptive width in interrupt mode.
  * @param  hflash            Pointer to a @ref hal_flash_handle_t structure.
  * @param  otp_addr          OTP address.
  * @param  p_data            Pointer to the data to be programmed.
  * @param  size_byte         Size of the data to be programmed (in bytes).
  * @note   The adaptive mode optimizes FLASH programming access based on the remaining data size,
  *         ignoring the programming mode selected by the HAL_FLASH_SetProgrammingMode() API.
  * @retval HAL_INVALID_PARAM Returned when an invalid input parameter selected.
  * @retval HAL_ERROR         Returned when the FLASH access registers locked or when the TrustZone enabled.
  * @retval HAL_BUSY          Returned when the FLASH is busy and cannot start a new programming operation.
  * @retval HAL_OK            Returned when the programming operation completes successfully.
  */
hal_status_t HAL_FLASH_OTP_ProgramByAddrAdapt_IT(hal_flash_handle_t *hflash,
                                                 uint32_t otp_addr,
                                                 const uint32_t *p_data,
                                                 uint32_t size_byte)
{
  ASSERT_DBG_PARAM(hflash != NULL);
  ASSERT_DBG_PARAM(p_data != NULL);
  ASSERT_DBG_PARAM(IS_FLASH_OTP_ADDRESS(otp_addr));
  ASSERT_DBG_PARAM(IS_FLASH_OTP_SIZE_IN_RANGE(otp_addr, size_byte));
  ASSERT_DBG_PARAM((size_byte != 0U) && ((size_byte % FLASH_HALFWORD_SIZE_BYTE) == 0U));
  ASSERT_DBG_STATE(hflash->global_state, (uint32_t)HAL_FLASH_STATE_IDLE);

#if defined(USE_HAL_CHECK_PARAM) && (USE_HAL_CHECK_PARAM == 1)
  if ((IS_FLASH_OTP_ADDRESS(otp_addr) == 0U) || (p_data == NULL))
  {
    return HAL_INVALID_PARAM;
  }

  if ((IS_FLASH_OTP_SIZE_IN_RANGE(otp_addr, size_byte) == 0U) || (size_byte == 0U))
  {
    return HAL_INVALID_PARAM;
  }
#endif /* USE_HAL_CHECK_PARAM */

  hflash->is_adaptive_prog = 1U;

  return FLASH_Program_IT(hflash, otp_addr, p_data, size_byte);
}

#if defined(USE_HAL_FLASH_OB_EDATA) && (USE_HAL_FLASH_OB_EDATA == 1)
/**
  * @brief  Program the EDATA area at specified address in polling mode.
  * @param  hflash            Pointer to a @ref hal_flash_handle_t structure.
  * @param  flash_addr        FLASH EDATA address.
  * @param  p_data            Pointer to the data to be programmed.
  * @param  size_byte         Size of the data to be programmed (in bytes).
  * @param  timeout_ms        Timeout value for programming.
  * @retval HAL_INVALID_PARAM Returned when an invalid input parameter selected.
  * @retval HAL_ERROR         Returned when the FLASH access registers locked.
  * @retval HAL_TIMEOUT       Internal processing exceeded the timeout.
  * @retval HAL_BUSY          Returned when the FLASH is busy and cannot start a new programming operation.
  * @retval HAL_OK            Returned when the programming operation completes successfully.
  */
hal_status_t HAL_FLASH_EDATA_ProgramByAddr(hal_flash_handle_t *hflash,
                                           uint32_t flash_addr,
                                           const uint32_t *p_data,
                                           uint32_t size_byte,
                                           uint32_t timeout_ms)
{
  ASSERT_DBG_PARAM(hflash != NULL);
  ASSERT_DBG_PARAM(p_data != NULL);
  ASSERT_DBG_PARAM(FLASH_IsFlashEDATAAddr(flash_addr, 1U) != 0U);
  ASSERT_DBG_PARAM(FLASH_IsFlashEDATAAddr(flash_addr + size_byte - 1U, 0U) != 0U);
  ASSERT_DBG_PARAM((hflash->programming_mode == HAL_FLASH_PROGRAM_HALFWORD) \
                   || (hflash->programming_mode == HAL_FLASH_PROGRAM_WORD));
  ASSERT_DBG_PARAM((size_byte != 0U) && ((size_byte % FLASH_GET_PROGRAM_SIZE(hflash->programming_mode)) == 0U));
  ASSERT_DBG_PARAM(IS_FLASH_NO_EDATA_CROSS_BANK(flash_addr, size_byte));
  ASSERT_DBG_STATE(hflash->global_state, (uint32_t)HAL_FLASH_STATE_IDLE);

#if defined(USE_HAL_CHECK_PARAM) && (USE_HAL_CHECK_PARAM == 1)
  if ((FLASH_IsFlashEDATAAddr(flash_addr, 1U) == 0U) || (p_data == NULL))
  {
    return HAL_INVALID_PARAM;
  }

  if ((FLASH_IsFlashEDATAAddr(flash_addr + size_byte - 1U, 0U) == 0U) || (size_byte == 0U))
  {
    return HAL_INVALID_PARAM;
  }
#endif /* USE_HAL_CHECK_PARAM */

