MaJerle/stm32-usart-uart-dma-rx-tx/drivers/STM32C5xx_drivers/hal/stm32c5xx_hal_flash.c
  ASSERT_DBG_PARAM(hflash != NULL);
  ASSERT_DBG_PARAM(FLASH_IsFlashUSERAddr(flash_addr, 1U) != 0U);
  ASSERT_DBG_PARAM(FLASH_IsFlashUSERAddr(flash_addr  + size_byte - 1U, 0U) != 0U);
  ASSERT_DBG_PARAM(size_byte != 0U);
  ASSERT_DBG_PARAM(IS_FLASH_NO_USER_CROSS_BANK(flash_addr, size_byte));
  ASSERT_DBG_STATE(hflash->global_state, (uint32_t)HAL_FLASH_STATE_IDLE);

#if defined(USE_HAL_CHECK_PARAM) && (USE_HAL_CHECK_PARAM == 1)
  if ((FLASH_IsFlashUSERAddr(flash_addr, 1U) == 0U) || (!IS_FLASH_NO_USER_CROSS_BANK(flash_addr, size_byte)))
  {
    return HAL_INVALID_PARAM;
  }

  if ((FLASH_IsFlashUSERAddr(flash_addr + size_byte - 1U, 0U) == 0U) || (size_byte == 0U))
  {
    return HAL_INVALID_PARAM;
  }
#endif /* USE_HAL_CHECK_PARAM */

#if defined(USE_HAL_FLASH_OB_EDATA) && (USE_HAL_FLASH_OB_EDATA == 1)
  page_size = FLASH_PAGE_SIZE;
#else
  page_size = ((flash_addr < FLASH_EXT_USER_BASE) ? FLASH_PAGE_SIZE : FLASH_EXT_USER_PAGE_SIZE);
#endif /* !USE_HAL_FLASH_OB_EDATA */

  return FLASH_EraseAddr(hflash, flash_addr, size_byte, page_size, timeout_ms);
}

/**
  * @brief  Erase the FLASH memory at specified address in interrupt mode.
  * @param  hflash            Pointer to a @ref hal_flash_handle_t structure.
  * @param  flash_addr        Start address of flash page to be erased.
  *                           This parameter must be aligned with the start of a page.
  * @param  size_byte         Size of the data to be erased (in bytes).
  *                           This parameter must be a multiple of the page size.
  *
  * @warning Since the smallest erase granularity is at page level, this function will erase a greater area than the one
  *          defined by flash_addr and size_byte if these parameters do not represent an area aligned with the start
  *          and the end of flash pages.
  *
  * @retval HAL_INVALID_PARAM Returned when an invalid input parameter selected.
  * @retval HAL_ERROR         Returned when the FLASH access registers locked.
  * @retval HAL_BUSY          Returned when the FLASH is busy and cannot start a new erase operation.
  * @retval HAL_OK            Returned when the erasing operation completes successfully.
  */
hal_status_t HAL_FLASH_EraseByAddr_IT(hal_flash_handle_t *hflash,
                                      uint32_t flash_addr,
                                      uint32_t size_byte)
{
  ASSERT_DBG_PARAM(hflash != NULL);
  ASSERT_DBG_PARAM(FLASH_IsFlashUSERAddr(flash_addr, 1U) != 0U);
  ASSERT_DBG_PARAM(FLASH_IsFlashUSERAddr(flash_addr  + size_byte - 1U, 0U) != 0U);
  ASSERT_DBG_PARAM(size_byte != 0U);
  ASSERT_DBG_PARAM(IS_FLASH_NO_USER_CROSS_BANK(flash_addr, size_byte));
  ASSERT_DBG_STATE(hflash->global_state, (uint32_t)HAL_FLASH_STATE_IDLE);

#if defined(USE_HAL_CHECK_PARAM) && (USE_HAL_CHECK_PARAM == 1)
  if ((FLASH_IsFlashUSERAddr(flash_addr, 1U) == 0U) || (!IS_FLASH_NO_USER_CROSS_BANK(flash_addr, size_byte)))
  {
    return HAL_INVALID_PARAM;
  }

  if ((FLASH_IsFlashUSERAddr(flash_addr + size_byte - 1U, 0U) == 0U) || (size_byte == 0U))
  {
    return HAL_INVALID_PARAM;
  }
#endif /* USE_HAL_CHECK_PARAM */

  return FLASH_EraseAddr_IT(hflash, flash_addr, size_byte);
}

#if defined(USE_HAL_FLASH_OB_EDATA) && (USE_HAL_FLASH_OB_EDATA == 1)
/**
  * @brief  Erase the FLASH EDATA memory at specified address in polling mode.
  * @param  hflash            Pointer to a @ref hal_flash_handle_t structure.
  * @param  flash_addr        Start address of flash page to be erased.
  *                           This parameter must be aligned with the start of a page.
  * @param  size_byte         Size of the area to be erased (in bytes).
  *                           This parameter must be a multiple of the page size.
  * @param  timeout_ms        Timeout value for erasing.
  *
  * @warning Since the smallest erase granularity is at page level, this function will erase a greater area than the one
  *          defined by flash_addr and size_byte if these parameters do not represent an area aligned with the start
  *          and the end of flash pages.
  *
  * @retval HAL_INVALID_PARAM Returned when an invalid input parameter selected.
  * @retval HAL_ERROR         Returned when the FLASH access registers locked.
  * @retval HAL_TIMEOUT       Internal processing exceeded the timeout.
  * @retval HAL_BUSY          Returned when the FLASH is busy and cannot start a new erase operation.
  * @retval HAL_OK            Returned when the erasing operation completes successfully.
  */
hal_status_t HAL_FLASH_EDATA_EraseByAddr(hal_flash_handle_t *hflash,
                                         uint32_t flash_addr,
                                         uint32_t size_byte,
                                         uint32_t timeout_ms)
{
  ASSERT_DBG_PARAM(hflash != NULL);
  ASSERT_DBG_PARAM(FLASH_IsFlashEDATAAddr(flash_addr, 1U) != 0U);
  ASSERT_DBG_PARAM(FLASH_IsFlashEDATAAddr(flash_addr  + size_byte - 1U, 0U) != 0U);
  ASSERT_DBG_PARAM(size_byte != 0U);
  ASSERT_DBG_PARAM(IS_FLASH_NO_EDATA_CROSS_BANK(flash_addr, size_byte));
  ASSERT_DBG_STATE(hflash->global_state, (uint32_t)HAL_FLASH_STATE_IDLE);

#if defined(USE_HAL_CHECK_PARAM) && (USE_HAL_CHECK_PARAM == 1)
  if ((FLASH_IsFlashEDATAAddr(flash_addr, 1U) == 0U) || (!IS_FLASH_NO_EDATA_CROSS_BANK(flash_addr, size_byte)))
  {
    return HAL_INVALID_PARAM;
  }

  if ((FLASH_IsFlashEDATAAddr(flash_addr + size_byte - 1U, 0U) == 0U) || (size_byte == 0U))
  {
    return HAL_INVALID_PARAM;
  }
#endif /* USE_HAL_CHECK_PARAM */

  return FLASH_EraseAddr(hflash, flash_addr, size_byte, FLASH_EDATA_PAGE_SIZE, timeout_ms);
}

/**
  * @brief  Erase the FLASH EDATA memory at specified address in interrupt mode.
  * @param  hflash            Pointer to a @ref hal_flash_handle_t structure.
  * @param  flash_addr        Start address of flash page to be erased.
  *                           This parameter must be aligned with the start of a page.
  * @param  size_byte         Size of the data to be erased (in bytes).
  *                           This parameter must be a multiple of the page size.
  *
  * @warning Since the smallest erase granularity is at page level, this function will erase a greater area than the one
  *          defined by flash_addr and size_byte if these parameters do not represent an area aligned with the start
  *          and the end of flash pages.
  *
  * @retval HAL_INVALID_PARAM Returned when an invalid input parameter selected.
  * @retval HAL_ERROR         Returned when the FLASH access registers locked.
  * @retval HAL_BUSY          Returned when the FLASH is busy and cannot start a new erase operation.
  * @retval HAL_OK            Returned when the erasing operation completes successfully.
  */
hal_status_t HAL_FLASH_EDATA_EraseByAddr_IT(hal_flash_handle_t *hflash,
                                            uint32_t flash_addr,
                                            uint32_t size_byte)
{
  ASSERT_DBG_PARAM(hflash != NULL);
  ASSERT_DBG_PARAM(FLASH_IsFlashEDATAAddr(flash_addr, 1U) != 0U);
  ASSERT_DBG_PARAM(FLASH_IsFlashEDATAAddr(flash_addr  + size_byte - 1U, 0U) != 0U);
  ASSERT_DBG_PARAM(size_byte != 0U);
  ASSERT_DBG_PARAM(IS_FLASH_NO_EDATA_CROSS_BANK(flash_addr, size_byte));
  ASSERT_DBG_STATE(hflash->global_state, (uint32_t)HAL_FLASH_STATE_IDLE);

#if defined(USE_HAL_CHECK_PARAM) && (USE_HAL_CHECK_PARAM == 1)
  if ((FLASH_IsFlashEDATAAddr(flash_addr, 1U) == 0U) || (!IS_FLASH_NO_EDATA_CROSS_BANK(flash_addr, size_byte)))
  {
    return HAL_INVALID_PARAM;
  }

  if ((FLASH_IsFlashEDATAAddr(flash_addr + size_byte - 1U, 0U) == 0U) || (size_byte == 0U))
  {
    return HAL_INVALID_PARAM;
  }
#endif /* USE_HAL_CHECK_PARAM */

  return FLASH_EraseAddr_IT(hflash, flash_addr, size_byte);
}
#endif /* USE_HAL_FLASH_OB_EDATA */
#endif /* USE_HAL_FLASH_ERASE_BY_ADDR */

#if defined (USE_HAL_FLASH_ERASE_PAGE) && (USE_HAL_FLASH_ERASE_PAGE == 1)
/**
  * @brief  Erase the FLASH memory by page in polling mode.
  * @param  hflash      Pointer to a @ref hal_flash_handle_t structure.
  * @param  bank        This parameter can be one of the following values:
  *                         @arg @ref HAL_FLASH_BANK_1
  *                         @arg @ref HAL_FLASH_BANK_2
  * @param  page        First page to be erased.
  * @param  page_nbr    Number of pages to be erased.
  * @param  timeout_ms  Timeout value for page erasing.
  * @retval HAL_ERROR   Returned when the FLASH access registers locked.
  * @retval HAL_TIMEOUT Internal processing exceeded the timeout.
  * @retval HAL_BUSY    Returned when the FLASH is busy and cannot start a new erase operation.
  * @retval HAL_OK      Returned when the erasing operation completes successfully.
  */
hal_status_t HAL_FLASH_ErasePage(hal_flash_handle_t *hflash,
                                 hal_flash_bank_t bank,
                                 uint32_t page,
                                 uint32_t page_nbr,
                                 uint32_t timeout_ms)
{
  ASSERT_DBG_PARAM(hflash != NULL);
  ASSERT_DBG_PARAM(bank != HAL_FLASH_BANK_ALL);
  ASSERT_DBG_PARAM(IS_FLASH_BANK(bank));
#if defined(USE_HAL_FLASH_OB_EDATA) && (USE_HAL_FLASH_OB_EDATA == 1)
  ASSERT_DBG_PARAM((page + page_nbr) <= FLASH_PAGE_NB);
#else
  ASSERT_DBG_PARAM(IS_FLASH_PAGE_IN_RANGE(page, page_nbr));
#endif /* USE_HAL_FLASH_OB_EDATA */
  ASSERT_DBG_STATE(hflash->global_state, (uint32_t)HAL_FLASH_STATE_IDLE);

  return FLASH_ErasePage(hflash, bank, page, page_nbr, FLASH_GET_ERASE_AREA(page), timeout_ms);
}

/**
  * @brief  Erase the FLASH memory by page in interrupt mode.
  * @param  hflash    Pointer to a @ref hal_flash_handle_t structure.
  * @param  bank      This parameter can be one of the following values:
  *                       @arg @ref HAL_FLASH_BANK_1
  *                       @arg @ref HAL_FLASH_BANK_2
  * @param  page      First page to be erased.
  * @param  page_nbr  Number of pages to be erased.
  * @retval HAL_ERROR Returned when the FLASH access registers locked.
  * @retval HAL_BUSY  Returned when the FLASH is busy and cannot start a new erase operation.
  * @retval HAL_OK    Returned when the erasing operation completes successfully.
  */
hal_status_t HAL_FLASH_ErasePage_IT(hal_flash_handle_t *hflash,
                                    hal_flash_bank_t bank,
                                    uint32_t page,
                                    uint32_t page_nbr)
{
  ASSERT_DBG_PARAM(hflash != NULL);
  ASSERT_DBG_PARAM(bank != HAL_FLASH_BANK_ALL);
  ASSERT_DBG_PARAM(IS_FLASH_BANK(bank));
#if defined(USE_HAL_FLASH_OB_EDATA) && (USE_HAL_FLASH_OB_EDATA == 1)
  ASSERT_DBG_PARAM((page + page_nbr) <= FLASH_PAGE_NB);
#else
  ASSERT_DBG_PARAM(IS_FLASH_PAGE_IN_RANGE(page, page_nbr));
#endif /* USE_HAL_FLASH_OB_EDATA */
  ASSERT_DBG_STATE(hflash->global_state, (uint32_t)HAL_FLASH_STATE_IDLE);

  return FLASH_ErasePage_IT(hflash, bank, page, page_nbr, FLASH_GET_ERASE_AREA(page));
}

#if defined(USE_HAL_FLASH_OB_EDATA) && (USE_HAL_FLASH_OB_EDATA == 1)
/**
  * @brief  Erase the FLASH EDATA memory by page in polling mode.
  * @param  hflash      Pointer to a @ref hal_flash_handle_t structure.
  * @param  bank        This parameter can be one of the following values:
  *                         @arg @ref HAL_FLASH_BANK_1
  *                         @arg @ref HAL_FLASH_BANK_2
  * @param  page        First page to be erased.
  * @param  page_nbr    Number of pages to be erased.
  * @param  timeout_ms  Timeout value for page erasing.
  * @retval HAL_ERROR   Returned when the FLASH access registers locked.
  * @retval HAL_TIMEOUT Internal processing exceeded the timeout.
  * @retval HAL_BUSY    Returned when the FLASH is busy and cannot start a new erase operation.
  * @retval HAL_OK      Returned when the erasing operation completes successfully.
  */
hal_status_t HAL_FLASH_EDATA_ErasePage(hal_flash_handle_t *hflash,
                                       hal_flash_bank_t bank,
                                       uint32_t page,
                                       uint32_t page_nbr,
                                       uint32_t timeout_ms)
{
  ASSERT_DBG_PARAM(hflash != NULL);
  ASSERT_DBG_PARAM(bank != HAL_FLASH_BANK_ALL);
  ASSERT_DBG_PARAM(IS_FLASH_BANK(bank));
  ASSERT_DBG_PARAM((page + page_nbr) <= FLASH_EDATA_PAGE_NB);

  ASSERT_DBG_STATE(hflash->global_state, (uint32_t)HAL_FLASH_STATE_IDLE);

  return FLASH_ErasePage(hflash, bank, page + FLASH_PAGE_NB, page_nbr, LL_FLASH_ERASE_EDATA_AREA, timeout_ms);
}

/**
  * @brief  Erase the FLASH EDATA memory by page in interrupt mode.
  * @param  hflash    Pointer to a @ref hal_flash_handle_t structure.
  * @param  bank      This parameter can be one of the following values:
  *                       @arg @ref HAL_FLASH_BANK_1
  *                       @arg @ref HAL_FLASH_BANK_2
  * @param  page      First page to be erased.
  * @param  page_nbr  Number of pages to be erased.
  * @retval HAL_ERROR Returned when the FLASH access registers locked.
  * @retval HAL_BUSY  Returned when the FLASH is busy and cannot start a new erase operation.
  * @retval HAL_OK    Returned when the erasing operation completes successfully.
  */
hal_status_t HAL_FLASH_EDATA_ErasePage_IT(hal_flash_handle_t *hflash,
                                          hal_flash_bank_t bank,
                                          uint32_t page,
                                          uint32_t page_nbr)
{
  ASSERT_DBG_PARAM(hflash != NULL);
  ASSERT_DBG_PARAM(bank != HAL_FLASH_BANK_ALL);
  ASSERT_DBG_PARAM(IS_FLASH_BANK(bank));
  ASSERT_DBG_PARAM((page + page_nbr) <= FLASH_EDATA_PAGE_NB);
  ASSERT_DBG_STATE(hflash->global_state, (uint32_t)HAL_FLASH_STATE_IDLE);

  return FLASH_ErasePage_IT(hflash, bank, page + FLASH_PAGE_NB, page_nbr, LL_FLASH_ERASE_EDATA_AREA);
}
#endif /* USE_HAL_FLASH_OB_EDATA */
#endif /* USE_HAL_FLASH_ERASE_PAGE */

#if defined (USE_HAL_FLASH_ERASE_BANK) && (USE_HAL_FLASH_ERASE_BANK == 1)
/**
  * @brief   Erase the FLASH memory by bank in polling mode.
  * @param   hflash      Pointer to a @ref hal_flash_handle_t structure.
  * @param   bank        Bank to be erased.
  *                      This parameter can be one of the following values:
  *                         @arg @ref HAL_FLASH_BANK_1
  *                         @arg @ref HAL_FLASH_BANK_2
  * @param   timeout_ms  Timeout value for bank erasing.
  * @warning This function will erase a specific Flash bank, thus it must not be mapped in this bank.
  * @retval  HAL_ERROR   Returned when the FLASH access registers locked.
  * @retval  HAL_TIMEOUT Internal processing exceeded the timeout.
  * @retval  HAL_BUSY    Returned when the FLASH is busy and cannot start a new erase operation.
  * @retval  HAL_OK      Returned when the erasing operation completes successfully.
  */
hal_status_t HAL_FLASH_EraseBank(hal_flash_handle_t *hflash, hal_flash_bank_t bank, uint32_t timeout_ms)
{
  ASSERT_DBG_PARAM(hflash != NULL);
  ASSERT_DBG_PARAM(bank != HAL_FLASH_BANK_ALL);
  ASSERT_DBG_PARAM(IS_FLASH_BANK(bank));
  ASSERT_DBG_STATE(hflash->global_state, (uint32_t)HAL_FLASH_STATE_IDLE);

