MaJerle/stm32-usart-uart-dma-rx-tx/drivers/STM32C5xx_drivers/hal/stm32c5xx_hal_flash.c
  hal_status_t status = FLASH_IsReadyForOperation(hflash);

  if (status == HAL_OK)
  {
    HAL_CHECK_UPDATE_STATE(hflash, global_state, HAL_FLASH_STATE_IDLE, HAL_FLASH_STATE_ACTIVE);

#if defined (USE_HAL_FLASH_GET_LAST_ERRORS) && (USE_HAL_FLASH_GET_LAST_ERRORS == 1)
    hflash->last_error_codes = HAL_FLASH_ERROR_NONE;
#endif /* USE_HAL_FLASH_GET_LAST_ERRORS */

    /* Fill the operation information structure */
    hflash->ongoing_operation = HAL_FLASH_BANK_ERASE;
    hflash->erase_bank = bank;

    LL_FLASH_StartEraseBank(FLASH_GET_INSTANCE(hflash), FLASH_GET_ERASE_BANK(hflash->erase_bank));

    status = FLASH_WaitForEndOfOperation(hflash, timeout_ms);

    LL_FLASH_DisableBankErase(FLASH_GET_INSTANCE(hflash), FLASH_GET_ERASE_BANK(bank));

    hflash->ongoing_operation = HAL_FLASH_NO_OPERATION;
    hflash->global_state = HAL_FLASH_STATE_IDLE;
  }

  return status;
}

/**
  * @brief   Erase the FLASH memory by bank in interrupt mode.
  * @param   hflash    Pointer to a @ref hal_flash_handle_t structure.
  * @param   bank      Bank to be erased.
  *                    This parameter can be one of the following values:
        *                  @arg @ref HAL_FLASH_BANK_1
        *                  @arg @ref HAL_FLASH_BANK_2
  * @warning This function will erase a specific Flash bank, thus it must not be mapped in this bank.
  * @retval  HAL_ERROR Returned when the FLASH access registers locked.
  * @retval  HAL_BUSY  Returned when the FLASH is busy and cannot start a new erase operation.
  * @retval  HAL_OK    Returned when the erasing operation completes successfully.
  */
hal_status_t HAL_FLASH_EraseBank_IT(hal_flash_handle_t *hflash, hal_flash_bank_t bank)
{
  ASSERT_DBG_PARAM(hflash != NULL);
  ASSERT_DBG_PARAM(bank != HAL_FLASH_BANK_ALL);
  ASSERT_DBG_PARAM(IS_FLASH_BANK(bank));
  ASSERT_DBG_STATE(hflash->global_state, (uint32_t)HAL_FLASH_STATE_IDLE);

  hal_status_t status = FLASH_IsReadyForOperation(hflash);

  if (status == HAL_OK)
  {
    HAL_CHECK_UPDATE_STATE(hflash, global_state, HAL_FLASH_STATE_IDLE, HAL_FLASH_STATE_ACTIVE);

#if defined (USE_HAL_FLASH_GET_LAST_ERRORS) && (USE_HAL_FLASH_GET_LAST_ERRORS == 1)
    hflash->last_error_codes = HAL_FLASH_ERROR_NONE;
#endif /* USE_HAL_FLASH_GET_LAST_ERRORS */

    /* Fill the operation information structure */
    hflash->ongoing_operation  = HAL_FLASH_BANK_ERASE;
    hflash->erase_bank = bank;

    LL_FLASH_ClearFlag_EOP(FLASH_GET_INSTANCE(hflash));
    LL_FLASH_EnableIT(FLASH_GET_INSTANCE(hflash), LL_FLASH_IT_ALL);
    LL_FLASH_StartEraseBank(FLASH_GET_INSTANCE(hflash), FLASH_GET_ERASE_BANK(hflash->erase_bank));
  }

  return status;
}
#endif /* USE_HAL_FLASH_ERASE_BANK */


#if defined (USE_HAL_FLASH_MASS_ERASE) && (USE_HAL_FLASH_MASS_ERASE == 1)
/**
  * @brief   Mass erase the FLASH memory in polling mode.
  * @param   hflash      Pointer to a @ref hal_flash_handle_t structure.
  * @param   timeout_ms  Timeout value for mass erasing.
  * @warning This function will erase the whole Flash, thus it must not be mapped in the Flash area.
  * @retval  HAL_ERROR   Returned when the FLASH access registers locked.
  * @retval  HAL_TIMEOUT Internal processing exceeded the timeout.
  * @retval  HAL_BUSY    Returned when the FLASH is busy and cannot start a new erase operation.
  * @retval  HAL_OK      Returned when the erasing operation completes successfully.
  */
hal_status_t HAL_FLASH_MassErase(hal_flash_handle_t *hflash, uint32_t timeout_ms)
{
  ASSERT_DBG_PARAM(hflash != NULL);
  ASSERT_DBG_STATE(hflash->global_state, (uint32_t)HAL_FLASH_STATE_IDLE);

  hal_status_t status = FLASH_IsReadyForOperation(hflash);

  if (status == HAL_OK)
  {
    HAL_CHECK_UPDATE_STATE(hflash, global_state, HAL_FLASH_STATE_IDLE, HAL_FLASH_STATE_ACTIVE);

#if defined (USE_HAL_FLASH_GET_LAST_ERRORS) && (USE_HAL_FLASH_GET_LAST_ERRORS == 1)
    hflash->last_error_codes = HAL_FLASH_ERROR_NONE;
#endif /* USE_HAL_FLASH_GET_LAST_ERRORS */

    /* Fill the operation information structure */
    hflash->ongoing_operation  = HAL_FLASH_MASS_ERASE;
    hflash->erase_bank = HAL_FLASH_BANK_ALL;

    LL_FLASH_StartMassErase(FLASH_GET_INSTANCE(hflash));

    status = FLASH_WaitForEndOfOperation(hflash, timeout_ms);

    LL_FLASH_DisableMassErase(FLASH_GET_INSTANCE(hflash));

    hflash->ongoing_operation = HAL_FLASH_NO_OPERATION;
    hflash->global_state = HAL_FLASH_STATE_IDLE;
  }

  return status;
}

/**
  * @brief   Mass erase the FLASH memory in interrupt mode.
  * @param   hflash            Pointer to a @ref hal_flash_handle_t structure.
  * @warning This function will erase the whole Flash, thus it must not be mapped in the Flash area.
  * @retval  HAL_ERROR         Returned when the FLASH access registers locked.
  * @retval  HAL_BUSY          Returned when the FLASH is busy and cannot start a new erase operation.
  * @retval  HAL_OK            Returned when the erasing operation completes successfully.
  */
hal_status_t HAL_FLASH_MassErase_IT(hal_flash_handle_t *hflash)
{
  ASSERT_DBG_PARAM(hflash != NULL);
  ASSERT_DBG_STATE(hflash->global_state, (uint32_t)HAL_FLASH_STATE_IDLE);

  hal_status_t status = FLASH_IsReadyForOperation(hflash);

  if (status == HAL_OK)
  {
    HAL_CHECK_UPDATE_STATE(hflash, global_state, HAL_FLASH_STATE_IDLE, HAL_FLASH_STATE_ACTIVE);

#if defined (USE_HAL_FLASH_GET_LAST_ERRORS) && (USE_HAL_FLASH_GET_LAST_ERRORS == 1)
    hflash->last_error_codes = HAL_FLASH_ERROR_NONE;
#endif /* USE_HAL_FLASH_GET_LAST_ERRORS */

    /* Fill the operation information structure */
    hflash->ongoing_operation  = HAL_FLASH_MASS_ERASE;
    hflash->erase_bank = HAL_FLASH_BANK_ALL;

    LL_FLASH_ClearFlag_EOP(FLASH_GET_INSTANCE(hflash));
    LL_FLASH_EnableIT(FLASH_GET_INSTANCE(hflash), LL_FLASH_IT_ALL);
    LL_FLASH_StartMassErase(FLASH_GET_INSTANCE(hflash));
  }

  return status;
}
#endif /* USE_HAL_FLASH_MASS_ERASE */


/**
  * @brief  Handle the FLASH interrupt request.
  * @param  hflash Pointer to a @ref hal_flash_handle_t structure.
  */

void HAL_FLASH_IRQHandler(hal_flash_handle_t *hflash)
{
  ASSERT_DBG_PARAM(hflash != NULL);

#if defined (USE_HAL_FLASH_PROGRAM_BY_ADDR) && (USE_HAL_FLASH_PROGRAM_BY_ADDR == 1)
  HAL_FLASH_ProgramByAddr_IRQHandler(hflash);
#endif /* USE_HAL_FLASH_PROGRAM_BY_ADDR */

#if defined (USE_HAL_FLASH_ERASE_BY_ADDR) && (USE_HAL_FLASH_ERASE_BY_ADDR == 1)
  HAL_FLASH_EraseByAddr_IRQHandler(hflash);
#endif /* USE_HAL_FLASH_ERASE_BY_ADDR */

#if defined (USE_HAL_FLASH_ERASE_PAGE) && (USE_HAL_FLASH_ERASE_PAGE == 1)
  HAL_FLASH_ErasePage_IRQHandler(hflash);
#endif /* USE_HAL_FLASH_ERASE_PAGE */

#if defined (USE_HAL_FLASH_ERASE_BANK) && (USE_HAL_FLASH_ERASE_BANK == 1)
  HAL_FLASH_EraseBank_IRQHandler(hflash);
#endif /* USE_HAL_FLASH_ERASE_BANK */

#if defined (USE_HAL_FLASH_MASS_ERASE) && (USE_HAL_FLASH_MASS_ERASE == 1)
  HAL_FLASH_MassErase_IRQHandler(hflash);
#endif /* USE_HAL_FLASH_MASS_ERASE */

