MaJerle/stm32-usart-uart-dma-rx-tx/drivers/STM32C5xx_drivers/hal/stm32c5xx_hal_flash.c
#if defined (USE_HAL_FLASH_ECC) && (USE_HAL_FLASH_ECC == 1)
  HAL_FLASH_ECC_IRQHandler(hflash);
#endif /* USE_HAL_FLASH_ECC */

#if (!defined(USE_HAL_FLASH_PROGRAM_BY_ADDR) || (USE_HAL_FLASH_PROGRAM_BY_ADDR != 1)) \
    && (!defined(USE_HAL_FLASH_ERASE_BY_ADDR) || (USE_HAL_FLASH_ERASE_BY_ADDR != 1)) \
    && (!defined(USE_HAL_FLASH_ERASE_PAGE) || (USE_HAL_FLASH_ERASE_PAGE != 1)) \
    && (!defined(USE_HAL_FLASH_ERASE_BANK) || (USE_HAL_FLASH_ERASE_BANK != 1)) \
    && (!defined(USE_HAL_FLASH_MASS_ERASE) || (USE_HAL_FLASH_MASS_ERASE != 1)) \
    && (!defined(USE_HAL_FLASH_ECC) || (USE_HAL_FLASH_ECC != 1))

  /* Prevent unused argument(s) compilation warning */
  STM32_UNUSED(hflash);

#endif /* (!defined(USE_HAL_FLASH_PROGRAM_BY_ADDR) || (USE_HAL_FLASH_PROGRAM_BY_ADDR != 1)) \
    && (!defined(USE_HAL_FLASH_ERASE_BY_ADDR) || (USE_HAL_FLASH_ERASE_BY_ADDR != 1)) \
    && (!defined(USE_HAL_FLASH_ERASE_PAGE) || (USE_HAL_FLASH_ERASE_PAGE != 1)) \
    && (!defined(USE_HAL_FLASH_ERASE_BANK) || (USE_HAL_FLASH_ERASE_BANK != 1)) \
    && (!defined(USE_HAL_FLASH_MASS_ERASE) || (USE_HAL_FLASH_MASS_ERASE != 1)) \
    && (!defined(USE_HAL_FLASH_ECC) || (USE_HAL_FLASH_ECC != 1)) */
}


#if defined (USE_HAL_FLASH_PROGRAM_BY_ADDR) && (USE_HAL_FLASH_PROGRAM_BY_ADDR == 1)
/**
  * @brief  Handle the FLASH program by address interrupt request.
  * @param  hflash Pointer to a @ref hal_flash_handle_t structure.
  */
void HAL_FLASH_ProgramByAddr_IRQHandler(hal_flash_handle_t *hflash)
{
  uint32_t flags;
  uint32_t prog_size;

  ASSERT_DBG_PARAM(hflash != NULL);

  if (hflash->ongoing_operation == HAL_FLASH_PROGRAM)
  {
    flags = LL_FLASH_ReadFlag(FLASH_GET_INSTANCE(hflash), LL_FLASH_FLAG_ERRORS_ALL | LL_FLASH_FLAG_EOP);

    if (STM32_READ_BIT(flags, LL_FLASH_FLAG_ERRORS_ALL) != 0U)
    {
#if defined(USE_HAL_FLASH_GET_LAST_ERRORS) && (USE_HAL_FLASH_GET_LAST_ERRORS == 1)
      FLASH_FillErrorCode(hflash, flags);
#endif /* USE_HAL_FLASH_GET_LAST_ERRORS */

      FLASH_HandleErrorIT(hflash, FLASH_GetBank(hflash, hflash->prog_flash_addr));
    }
    else
    {
      if (STM32_READ_BIT(flags, LL_FLASH_FLAG_EOP) != 0U)
      {
        LL_FLASH_ClearFlag_EOP(FLASH_GET_INSTANCE(hflash));
        prog_size = hflash->prog_size_byte;

        /* Check if there are still data to program */
        if (hflash->count > prog_size)
        {
          hflash->count           -= prog_size;
          hflash->prog_data_addr  += prog_size;
          hflash->prog_flash_addr += prog_size;

          if (hflash->is_adaptive_prog != 0U)
          {
            FLASH_UpdateAdaptiveProgMode(hflash);
          }

          hflash->p_prog_unit_func(hflash);
        }
        else
        {
          LL_FLASH_DisableIT(FLASH_GET_INSTANCE(hflash), LL_FLASH_IT_ALL);
          LL_FLASH_DisableProgramming(FLASH_GET_INSTANCE(hflash));

          hflash->count            = 0;
          hflash->prog_data_addr  += (prog_size - 1U);
          hflash->prog_flash_addr += (prog_size - 1U);

          hflash->ongoing_operation = HAL_FLASH_NO_OPERATION;
          hflash->global_state = HAL_FLASH_STATE_IDLE;

#if defined (USE_HAL_FLASH_REGISTER_CALLBACKS) && (USE_HAL_FLASH_REGISTER_CALLBACKS == 1)
          hflash->p_program_cplt_cb(hflash, (hflash->prog_flash_addr - hflash->size + 1U), hflash->size);
#else
          HAL_FLASH_ProgramCpltCallback(hflash, (hflash->prog_flash_addr - hflash->size + 1U), hflash->size);
#endif /* USE_HAL_FLASH_REGISTER_CALLBACKS */
        }
      }
    }
  }
}
#endif /* USE_HAL_FLASH_PROGRAM_BY_ADDR */

#if defined (USE_HAL_FLASH_ERASE_BY_ADDR) && (USE_HAL_FLASH_ERASE_BY_ADDR == 1)
/**
  * @brief  Handle the FLASH erase by address interrupt request.
  * @param  hflash Pointer to a @ref hal_flash_handle_t structure.
  */
void HAL_FLASH_EraseByAddr_IRQHandler(hal_flash_handle_t *hflash)
{
  uint32_t flags;
  uint32_t page_size;
  uint32_t erased_size;
  uint32_t erase_area;

  ASSERT_DBG_PARAM(hflash != NULL);

  if (hflash->ongoing_operation == HAL_FLASH_ADDR_ERASE)
  {
    flags = LL_FLASH_ReadFlag(FLASH_GET_INSTANCE(hflash), LL_FLASH_FLAG_ERRORS_ALL | LL_FLASH_FLAG_EOP);

    if (STM32_READ_BIT(flags, LL_FLASH_FLAG_ERRORS_ALL) != 0U)
    {
#if defined(USE_HAL_FLASH_GET_LAST_ERRORS) && (USE_HAL_FLASH_GET_LAST_ERRORS == 1)
      FLASH_FillErrorCode(hflash, flags);
#endif /* USE_HAL_FLASH_GET_LAST_ERRORS */

      FLASH_HandleErrorIT(hflash, hflash->erase_bank);
    }
    else
    {
      if (STM32_READ_BIT(flags, LL_FLASH_FLAG_EOP) != 0U)
      {
        LL_FLASH_ClearFlag_EOP(FLASH_GET_INSTANCE(hflash));

        /* Update erase count */
        page_size = FLASH_GetPageSizeByAddr(hflash->erase_page);
        erased_size = page_size - (hflash->erase_page % page_size);

        /* Check if there are still pages to erase */
        if (hflash->count > erased_size)
        {
          /* Prepare and call next erase operation */
          hflash->count -= erased_size;
          hflash->erase_page += erased_size;
          erase_area = FLASH_GET_ERASE_AREA_ADDR(hflash->erase_page);
          LL_FLASH_StartErasePage(FLASH_GET_INSTANCE(hflash), FLASH_GET_ERASE_BANK(hflash->erase_bank), \
                                  erase_area, FLASH_GetPageIndexByAddr(hflash->erase_page));
        }
        else
        {
          LL_FLASH_DisableIT(FLASH_GET_INSTANCE(hflash), LL_FLASH_IT_ALL);
          LL_FLASH_DisablePageErase(FLASH_GET_INSTANCE(hflash));
          erased_size = hflash->count;
          hflash->erase_page += erased_size - 1U;
          hflash->count = 0U;
          hflash->ongoing_operation = HAL_FLASH_NO_OPERATION;
          hflash->global_state = HAL_FLASH_STATE_IDLE;

#if defined (USE_HAL_FLASH_REGISTER_CALLBACKS) && (USE_HAL_FLASH_REGISTER_CALLBACKS == 1)
          hflash->p_erase_by_addr_cplt_cb(hflash, (hflash->erase_page - hflash->size + 1U), hflash->size);
#else
          HAL_FLASH_EraseByAddrCpltCallback(hflash, (hflash->erase_page - hflash->size + 1U), hflash->size);
#endif /* USE_HAL_FLASH_REGISTER_CALLBACKS */
        }
      }
    }
  }
}
#endif /* USE_HAL_FLASH_ERASE_BY_ADDR */

#if defined (USE_HAL_FLASH_ERASE_PAGE) && (USE_HAL_FLASH_ERASE_PAGE == 1)
/**
  * @brief  Handle the FLASH erase page interrupt request.
  * @param  hflash Pointer to a @ref hal_flash_handle_t structure.
  */
void HAL_FLASH_ErasePage_IRQHandler(hal_flash_handle_t *hflash)
{
  uint32_t flags;
  uint32_t erase_area;

