MaJerle/stm32-usart-uart-dma-rx-tx/drivers/STM32C5xx_drivers/hal/stm32c5xx_hal_flash.c
  ASSERT_DBG_PARAM(hflash != NULL);

  if (hflash->ongoing_operation == HAL_FLASH_PAGE_ERASE)
  {
    flags = LL_FLASH_ReadFlag(FLASH_GET_INSTANCE(hflash), LL_FLASH_FLAG_ERRORS_ALL | LL_FLASH_FLAG_EOP);

    if (STM32_READ_BIT(flags, LL_FLASH_FLAG_ERRORS_ALL) != 0U)
    {
#if defined(USE_HAL_FLASH_GET_LAST_ERRORS) && (USE_HAL_FLASH_GET_LAST_ERRORS == 1)
      FLASH_FillErrorCode(hflash, flags);
#endif /* USE_HAL_FLASH_GET_LAST_ERRORS */

      FLASH_HandleErrorIT(hflash, hflash->erase_bank);
    }
    else
    {
      if (STM32_READ_BIT(flags, LL_FLASH_FLAG_EOP) != 0U)
      {
        LL_FLASH_ClearFlag_EOP(FLASH_GET_INSTANCE(hflash));

        hflash->count--;

        /* Check if there are still pages to erase */
        if (hflash->count > 0U)
        {
          /* Prepare and call next erase operation */
          hflash->erase_page++;
          erase_area = FLASH_GET_ERASE_AREA(hflash->erase_page);
          LL_FLASH_StartErasePage(FLASH_GET_INSTANCE(hflash), FLASH_GET_ERASE_BANK(hflash->erase_bank), \
                                  erase_area, FLASH_GET_HW_PAGE_INDEX(hflash->erase_page, FLASH_PAGE_NB));
        }
        else /* No more pages to erase */
        {
          LL_FLASH_DisableIT(FLASH_GET_INSTANCE(hflash), LL_FLASH_IT_ALL);
          LL_FLASH_DisablePageErase(FLASH_GET_INSTANCE(hflash));

          hflash->ongoing_operation = HAL_FLASH_NO_OPERATION;
          hflash->global_state = HAL_FLASH_STATE_IDLE;

#if defined (USE_HAL_FLASH_REGISTER_CALLBACKS) && (USE_HAL_FLASH_REGISTER_CALLBACKS == 1)
          hflash->p_erase_page_cplt_cb(hflash, hflash->erase_bank, \
                                       FLASH_GET_HW_PAGE_INDEX((hflash->erase_page - hflash->size + 1U), \
                                                               FLASH_PAGE_NB), \
                                       hflash->size);
#else
          HAL_FLASH_ErasePageCpltCallback(hflash, hflash->erase_bank, \
                                          FLASH_GET_HW_PAGE_INDEX((hflash->erase_page - hflash->size + 1U), \
                                                                  FLASH_PAGE_NB), \
                                          hflash->size);
#endif /* USE_HAL_FLASH_REGISTER_CALLBACKS */
        }
      }
    }
  }
}
#endif /* USE_HAL_FLASH_ERASE_PAGE */

#if defined (USE_HAL_FLASH_ERASE_BANK) && (USE_HAL_FLASH_ERASE_BANK == 1)
/**
  * @brief  Handle the FLASH erase bank interrupt request.
  * @param  hflash Pointer to a @ref hal_flash_handle_t structure.
  */
void HAL_FLASH_EraseBank_IRQHandler(hal_flash_handle_t *hflash)
{
  uint32_t flags;

  ASSERT_DBG_PARAM(hflash != NULL);

  if (hflash->ongoing_operation == HAL_FLASH_BANK_ERASE)
  {
    flags = LL_FLASH_ReadFlag(FLASH_GET_INSTANCE(hflash), LL_FLASH_FLAG_ERRORS_ALL | LL_FLASH_FLAG_EOP);

    if (STM32_READ_BIT(flags, LL_FLASH_FLAG_ERRORS_ALL) != 0U)
    {
#if defined(USE_HAL_FLASH_GET_LAST_ERRORS) && (USE_HAL_FLASH_GET_LAST_ERRORS == 1)
      FLASH_FillErrorCode(hflash, flags);
#endif /* USE_HAL_FLASH_GET_LAST_ERRORS */

      FLASH_HandleErrorIT(hflash, hflash->erase_bank);
    }
    else
    {
      if (STM32_READ_BIT(flags, LL_FLASH_FLAG_EOP) != 0U)
      {
        LL_FLASH_ClearFlag_EOP(FLASH_GET_INSTANCE(hflash));
        LL_FLASH_DisableIT(FLASH_GET_INSTANCE(hflash), LL_FLASH_IT_ALL);
        LL_FLASH_DisableBankErase(FLASH_GET_INSTANCE(hflash), (uint32_t)hflash->erase_bank);

        hflash->ongoing_operation = HAL_FLASH_NO_OPERATION;
        hflash->global_state = HAL_FLASH_STATE_IDLE;

#if defined (USE_HAL_FLASH_REGISTER_CALLBACKS) && (USE_HAL_FLASH_REGISTER_CALLBACKS == 1)
        hflash->p_erase_bank_cplt_cb(hflash, hflash->erase_bank);
#else
        HAL_FLASH_EraseBankCpltCallback(hflash, hflash->erase_bank);
#endif /* USE_HAL_FLASH_REGISTER_CALLBACKS */
      }
    }
  }
}
#endif /* USE_HAL_FLASH_ERASE_BANK */


#if defined (USE_HAL_FLASH_MASS_ERASE) && (USE_HAL_FLASH_MASS_ERASE == 1)
/**
  * @brief  Handle the FLASH mass erase interrupt request.
  * @param  hflash Pointer to a @ref hal_flash_handle_t structure.
  */
void HAL_FLASH_MassErase_IRQHandler(hal_flash_handle_t *hflash)
{
  ASSERT_DBG_PARAM(hflash != NULL);

  uint32_t flags = LL_FLASH_ReadFlag(FLASH_GET_INSTANCE(hflash), LL_FLASH_FLAG_ERRORS_ALL);

  if (hflash->ongoing_operation == HAL_FLASH_MASS_ERASE)
  {
    flags |= LL_FLASH_ReadFlag(FLASH_GET_INSTANCE(hflash), LL_FLASH_FLAG_EOP);

    if (STM32_READ_BIT(flags, LL_FLASH_FLAG_ERRORS_ALL) != 0U)
    {
#if defined(USE_HAL_FLASH_GET_LAST_ERRORS) && (USE_HAL_FLASH_GET_LAST_ERRORS == 1)
      FLASH_FillErrorCode(hflash, flags);
#endif /* USE_HAL_FLASH_GET_LAST_ERRORS */

      FLASH_HandleErrorIT(hflash, HAL_FLASH_BANK_ALL);
    }
    else
    {
      if (STM32_READ_BIT(flags, LL_FLASH_FLAG_EOP) != 0U)
      {
        LL_FLASH_ClearFlag_EOP(FLASH_GET_INSTANCE(hflash));
        LL_FLASH_DisableIT(FLASH_GET_INSTANCE(hflash), LL_FLASH_IT_ALL);
        LL_FLASH_DisableMassErase(FLASH_GET_INSTANCE(hflash));

        hflash->ongoing_operation = HAL_FLASH_NO_OPERATION;
        hflash->global_state = HAL_FLASH_STATE_IDLE;

#if defined (USE_HAL_FLASH_REGISTER_CALLBACKS) && (USE_HAL_FLASH_REGISTER_CALLBACKS == 1)
        hflash->p_mass_erase_cplt_cb(hflash);
#else
        HAL_FLASH_MassEraseCpltCallback(hflash);
#endif /* USE_HAL_FLASH_REGISTER_CALLBACKS */
      }
    }
  }
}
#endif /* USE_HAL_FLASH_MASS_ERASE */

#if defined (USE_HAL_FLASH_ECC) && (USE_HAL_FLASH_ECC == 1)
/**
  * @brief  Handle the FLASH ITF NMI interrupt request.
  * @param hflash Pointer to a @ref hal_flash_handle_t structure.
  * @retval HAL_ERROR Returned when the NMI has not been handled by this function.
  * @retval HAL_OK    Returned when the NMI has been handled by this function.
  */
hal_status_t HAL_FLASH_NMI_IRQHandler(hal_flash_handle_t *hflash)
{
  hal_status_t cb_status = HAL_ERROR;
  ASSERT_DBG_PARAM(hflash != NULL);

  if (LL_FLASH_IsActiveFlag_ECCD(FLASH_GET_INSTANCE(hflash)) != 0U)
  {
    /* Double ECC flag is only cleared if the callback returns HAL_OK,
       i.e. if the NMI is specifically handled in the callback. */
#if defined (USE_HAL_FLASH_REGISTER_CALLBACKS) && (USE_HAL_FLASH_REGISTER_CALLBACKS == 1)
    if (hflash->p_ecc_error_cb(hflash, ((LL_FLASH_IsActiveFlag_BK_ECCD(FLASH_GET_INSTANCE(hflash)) == 0U) \
                                        ? HAL_FLASH_BANK_1 : HAL_FLASH_BANK_2)) == HAL_OK)
#else
    if (HAL_FLASH_ECC_ErrorCallback(hflash, ((LL_FLASH_IsActiveFlag_BK_ECCD(FLASH_GET_INSTANCE(hflash)) == 0U) \
                                             ? HAL_FLASH_BANK_1 : HAL_FLASH_BANK_2)) == HAL_OK)
#endif /* USE_HAL_FLASH_REGISTER_CALLBACKS */
    {
      LL_FLASH_ClearFlag_ECCD(FLASH_GET_INSTANCE(hflash));

      cb_status = HAL_OK;
    }
  }

  return cb_status;
}

/**
  * @brief  Handle the FLASH ITF ECC correction interrupt request.
  * @param hflash Pointer to a @ref hal_flash_handle_t structure.
  */
void HAL_FLASH_ECC_IRQHandler(hal_flash_handle_t *hflash)
{
  ASSERT_DBG_PARAM(hflash != NULL);
  uint32_t flags = LL_FLASH_IsEnabledIT_ECCC(FLASH_GET_INSTANCE(hflash));
  uint32_t its   = LL_FLASH_IsActiveFlag_ECCC(FLASH_GET_INSTANCE(hflash));
  if ((flags != 0U) && (its != 0U))
  {
#if defined (USE_HAL_FLASH_REGISTER_CALLBACKS) && (USE_HAL_FLASH_REGISTER_CALLBACKS == 1)
    hflash->p_ecc_error_cb(hflash, ((LL_FLASH_IsActiveFlag_BK_ECCC(FLASH_GET_INSTANCE(hflash)) == 0U) \
                                    ? HAL_FLASH_BANK_1 : HAL_FLASH_BANK_2));
#else
    HAL_FLASH_ECC_ErrorCallback(hflash, ((LL_FLASH_IsActiveFlag_BK_ECCC(FLASH_GET_INSTANCE(hflash)) == 0U) \
                                         ? HAL_FLASH_BANK_1 : HAL_FLASH_BANK_2));
#endif /* USE_HAL_FLASH_REGISTER_CALLBACKS */

    LL_FLASH_ClearFlag_ECCC(FLASH_GET_INSTANCE(hflash));
  }
}
#endif /* USE_HAL_FLASH_ECC */
/**
  * @}
  */

