MaJerle/stm32-usart-uart-dma-rx-tx/drivers/STM32C5xx_drivers/hal/stm32c5xx_hal_flash.c
/** @addtogroup FLASH_Exported_Functions_Group4
  * @{

This subsection provides a set of functions allowing management of the FLASH callbacks:

- The weak function HAL_FLASH_ProgramCpltCallback() can be redefined within user application for the program complete
  callback.

- The weak function HAL_FLASH_EraseByAddrCpltCallback() can be redefined within user application for the erase by
  address complete callback.

- The weak function HAL_FLASH_ErasePageCpltCallback() can be redefined within user application for the erase by page
  complete callback.

- The weak function HAL_FLASH_EraseBankCpltCallback() can be redefined within user application for the bank erase
  complete callback.

- The weak function HAL_FLASH_MassEraseCpltCallback() can be redefined within user application for the mass erase
  complete callback.

- The weak function HAL_FLASH_ErrorCallback() can be redefined within user application for the error callback.

- The weak function HAL_FLASH_ECC_ErrorCallback() can be redefined within user application for the ECC error callback.

- Call the function HAL_FLASH_RegisterProgramCpltCallback() to register the FLASH program complete callback.

- Call the function HAL_FLASH_RegisterEraseByAddrCpltCallback() to register the FLASH erase by address complete
  callback.

- Call the function HAL_FLASH_RegisterErasePageCpltCallback() to register the FLASH erase by page complete callback.

- Call the function HAL_FLASH_RegisterEraseBankCpltCallback() to register the FLASH bank erase complete callback.

- Call the function HAL_FLASH_RegisterMassEraseCpltCallback() to register the FLASH as erase complete callback.

- Call the function HAL_FLASH_RegisterErrorCallback() to register the FLASH error callback.

- Call the function HAL_FLASH_RegisterECCErrorCallback() to register the FLASH ECC error callback.
  */

#if defined (USE_HAL_FLASH_PROGRAM_BY_ADDR) && (USE_HAL_FLASH_PROGRAM_BY_ADDR == 1)
/**
  * @brief  FLASH program complete callback.
  * @param  hflash Pointer to a @ref hal_flash_handle_t structure.
  * @param  flash_addr Programmed address.
  * @param  size_byte  Programmed size in byte.
  */
__WEAK void HAL_FLASH_ProgramCpltCallback(hal_flash_handle_t *hflash, uint32_t flash_addr, uint32_t size_byte)
{
  /* Prevent unused argument(s) compilation warning */
  STM32_UNUSED(hflash);
  STM32_UNUSED(flash_addr);
  STM32_UNUSED(size_byte);

  /*! WARNING: This function must not be modified, when the callback is needed, the
               HAL_FLASH_ProgramCpltCallback() can be implemented in the user file */
}
#endif /* USE_HAL_FLASH_PROGRAM_BY_ADDR */

#if defined (USE_HAL_FLASH_ERASE_BY_ADDR) && (USE_HAL_FLASH_ERASE_BY_ADDR == 1)
/**
  * @brief  FLASH erase by address complete callback.
  * @param  hflash     Pointer to a @ref hal_flash_handle_t structure.
  * @param  flash_addr Erased address.
  * @param  size_byte  Erased size in byte.
  */
__WEAK void HAL_FLASH_EraseByAddrCpltCallback(hal_flash_handle_t *hflash, uint32_t flash_addr, uint32_t size_byte)
{
  /* Prevent unused argument(s) compilation warning */
  STM32_UNUSED(hflash);
  STM32_UNUSED(flash_addr);
  STM32_UNUSED(size_byte);

  /*! WARNING: This function must not be modified, when the callback is needed, the
               HAL_FLASH_EraseByAddrCpltCallback() can be implemented in the user file */
}
#endif /* USE_HAL_FLASH_ERASE_BY_ADDR */

#if defined (USE_HAL_FLASH_ERASE_PAGE) && (USE_HAL_FLASH_ERASE_PAGE == 1)
/**
  * @brief  FLASH erase by page complete callback.
  * @param  hflash   Pointer to a @ref hal_flash_handle_t structure.
  * @param  bank     This parameter can be one of the following values:
  *                      @arg @ref HAL_FLASH_BANK_1
  *                      @arg @ref HAL_FLASH_BANK_2
  * @param  page     Index of erased page.
  * @param  page_nbr Number of erased pages.
  */
__WEAK void HAL_FLASH_ErasePageCpltCallback(hal_flash_handle_t *hflash,
                                            hal_flash_bank_t bank,
                                            uint32_t page,
                                            uint32_t page_nbr)
{
  /* Prevent unused argument(s) compilation warning */
  STM32_UNUSED(hflash);
  STM32_UNUSED(bank);
  STM32_UNUSED(page);
  STM32_UNUSED(page_nbr);

  /*! WARNING: This function must not be modified, when the callback is needed, the
               HAL_FLASH_ErasePageCpltCallback() can be implemented in the user file */
}
#endif /* USE_HAL_FLASH_ERASE_PAGE */

#if defined (USE_HAL_FLASH_ERASE_BANK) && (USE_HAL_FLASH_ERASE_BANK == 1)
/**
  * @brief  FLASH bank erase complete callback.
  * @param  hflash Pointer to a @ref hal_flash_handle_t structure.
  * @param  bank   This parameter can be one of the following values:
  *                    @arg @ref HAL_FLASH_BANK_1
  *                    @arg @ref HAL_FLASH_BANK_2
  */
__WEAK void HAL_FLASH_EraseBankCpltCallback(hal_flash_handle_t *hflash, hal_flash_bank_t bank)
{
  /* Prevent unused argument(s) compilation warning */
  STM32_UNUSED(hflash);
  STM32_UNUSED(bank);

  /*! WARNING: This function must not be modified, when the callback is needed, the
               HAL_FLASH_EraseBankCpltCallback() can be implemented in the user file */
}
#endif /* USE_HAL_FLASH_ERASE_BANK */

#if defined (USE_HAL_FLASH_MASS_ERASE) && (USE_HAL_FLASH_MASS_ERASE == 1)
/**
  * @brief  FLASH mass erase complete callback.
  * @param  hflash Pointer to a @ref hal_flash_handle_t structure.
  */
__WEAK void HAL_FLASH_MassEraseCpltCallback(hal_flash_handle_t *hflash)
{
  /* Prevent unused argument(s) compilation warning */
  STM32_UNUSED(hflash);

  /*! WARNING: This function must not be modified, when the callback is needed, the
               HAL_FLASH_MassEraseCpltCallback() can be implemented in the user file */
}
#endif /* USE_HAL_FLASH_MASS_ERASE */

/**
  * @brief  FLASH error callback.
  * @param  hflash Pointer to a @ref hal_flash_handle_t structure.
  * @param  bank   This parameter can be one element of the @ref hal_flash_bank_t enumeration.
  */
__WEAK void HAL_FLASH_ErrorCallback(hal_flash_handle_t *hflash, hal_flash_bank_t bank)
{
  /* Prevent unused argument(s) compilation warning */
  STM32_UNUSED(hflash);
  STM32_UNUSED(bank);

