MaJerle/stm32-usart-uart-dma-rx-tx/drivers/STM32C5xx_drivers/hal/stm32c5xx_hal_flash.c
#if defined (USE_HAL_FLASH_ECC) && (USE_HAL_FLASH_ECC == 1)
/**
  * @brief  Register the FLASH ECC error callback.
  * @param  hflash            Pointer to a @ref hal_flash_handle_t structure.
  * @param  callback          Specifies the error callback.
  * @retval HAL_INVALID_PARAM Returned when an invalid input parameter selected.
  * @retval HAL_OK            Returned when the register of the callback completes successfully.
  */
hal_status_t HAL_FLASH_RegisterECCErrorCallback(hal_flash_handle_t *hflash, hal_flash_ecc_error_cb_t callback)
{
  ASSERT_DBG_PARAM(hflash   != NULL);
  ASSERT_DBG_PARAM(callback != NULL);
  ASSERT_DBG_STATE(hflash->global_state, (uint32_t)HAL_FLASH_STATE_IDLE);

#if defined (USE_HAL_CHECK_PARAM) && (USE_HAL_CHECK_PARAM == 1)
  if (callback == NULL)
  {
    return HAL_INVALID_PARAM;
  }
#endif /* USE_HAL_CHECK_PARAM */

  /* Register the FLASH error callback  */
  hflash->p_ecc_error_cb = callback;

  return HAL_OK;
}
#endif /* USE_HAL_FLASH_ECC */

#endif /* USE_HAL_FLASH_REGISTER_CALLBACKS */
/**
  * @}
  */

/** @addtogroup FLASH_Exported_Functions_Group5
  * @{

This subsection provides a set of functions allowing access to FLASH data information and status:

- Call the function HAL_FLASH_GetCurrentOperation() to get the current flash operation.

- Call the function HAL_FLASH_GetCurrentProgrammedAddr() to get the currently being programmed flash address.

- Call the function HAL_FLASH_GetCurrentErasedAddr() to get the currently being erased flash address.

- Call the function HAL_FLASH_GetCurrentErasedPage() to get the currently being erased flash page.

- Call the function HAL_FLASH_GetInterruptedByResetOperationInfo() to get the FLASH interrupted operation information.

- Call the function HAL_FLASH_GetInfo() to get the FLASH information.

- Call the function HAL_FLASH_GetSizeByte() to get the FLASH total size.

- Call the function HAL_FLASH_GetBankNbr() to get the FLASH number of banks.

- Call the function HAL_FLASH_GetBankSizeByte() to get the FLASH bank size.

- Call the function HAL_FLASH_GetUserFlashSizeByte() to get the FLASH USER area size within a bank.

- Call the function HAL_FLASH_EDATA_GetSizeByte() to get the FLASH EDATA area size within a bank

- Call the function HAL_FLASH_GetExtUserFlashSizeByte() to get the FLASH Extended USER area size within a bank.

- Call the function HAL_FLASH_GetUserFlashPageNbr() to get the number of pages in FLASH USER area.

- Call the function HAL_FLASH_EDATA_GetPageNbr() to get the number of pages in FLASH EDATA area.

- Call the function HAL_FLASH_GetExtUserFlashPageNbr() to get the number of pages in FLASH extended USER area.

- Call the function HAL_FLASH_GetUserFlashPageSizeByte() to get the FLASH size of a given page in FLASH USER area.

- Call the function HAL_FLASH_EDATA_GetPageSizeByte() to get the FLASH size of a given page in FLASH EDATA area.

- Call the function HAL_FLASH_GetExtUserFlashPageSizeByte() to get the FLASH size of a given page in FLASH extended
  USER area.

- Call the function HAL_FLASH_GetUserFlashAddrOffset() to get the address offset of a specific page in FLASH USER area.

- Call the function HAL_FLASH_EDATA_GetAddrOffset() to get the address offset of a specific page in FLASH EDATA area.

- Call the function HAL_FLASH_GetExtUserFlashAddrOffset() to get the address offset of a specific page in FLASH extended
  USER area. The offset is computed from the beginning of the FLASH extended USER area.

- Call the function HAL_FLASH_ECC_GetInfo() to get the FLASH ECC information.

- Call the function HAL_FLASH_GetInstance() to get the HAL FLASH instance.

- Call the function HAL_FLASH_GetLLInstance() to get the hardware FLASH instance.

- Call the function HAL_FLASH_GetState() to get the FLASH current state.

- Call the function HAL_FLASH_GetLastErrorCodes() to get the FLASH last errors codes.

- Call the function HAL_FLASH_SetUserData() to set a user data in the FLASH handle.

- Call the function HAL_FLASH_GetUserData() to get a user data from the FLASH handle.
  */


/**
  * @brief  Get the current operation on the given bank.
  * @param  hflash Pointer to a @ref hal_flash_handle_t structure.
  * @param  bank   This parameter can be one of the following values:
  *                    @arg @ref HAL_FLASH_BANK_1
  *                    @arg @ref HAL_FLASH_BANK_2
  * @retval hal_flash_operation_t Operation ongoing.
  */
hal_flash_operation_t HAL_FLASH_GetCurrentOperation(const hal_flash_handle_t *hflash, hal_flash_bank_t bank)
{
  ASSERT_DBG_PARAM(hflash != NULL);
  ASSERT_DBG_PARAM(IS_FLASH_BANK(bank));
  ASSERT_DBG_STATE(hflash->global_state, (uint32_t)HAL_FLASH_STATE_IDLE | (uint32_t)HAL_FLASH_STATE_ACTIVE);

  STM32_UNUSED(bank);

  return (hflash->ongoing_operation);
}

#if defined (USE_HAL_FLASH_PROGRAM_BY_ADDR) && (USE_HAL_FLASH_PROGRAM_BY_ADDR == 1)
/**
  * @brief  Get the last programming operation information.
  *
  * @param  hflash   Pointer to a @ref hal_flash_handle_t structure.
  * @param  bank     This parameter can be one of the following values:
  *                      @arg @ref HAL_FLASH_BANK_1
  *                      @arg @ref HAL_FLASH_BANK_2
  * @note   This function must be called during or directly after a ProgramByAddr operation, otherwise the returned
  *         information could not be true anymore.
  * @retval uint32_t FLASH address currently being programmed.
  *                  0xFFFFFFFF if no program by address operation is ongoing on the given bank.
  */
uint32_t HAL_FLASH_GetCurrentProgrammedAddr(const hal_flash_handle_t *hflash, hal_flash_bank_t bank)
{
  uint32_t prog_flash_addr;
  hal_flash_bank_t current_bank;

  ASSERT_DBG_PARAM(hflash != NULL);
  ASSERT_DBG_PARAM(IS_FLASH_BANK(bank));
  ASSERT_DBG_STATE(hflash->global_state, (uint32_t)HAL_FLASH_STATE_IDLE | (uint32_t)HAL_FLASH_STATE_ACTIVE);

  prog_flash_addr = hflash->prog_flash_addr;
  current_bank = FLASH_GetBank(hflash, prog_flash_addr);

  if ((hflash->ongoing_operation != HAL_FLASH_PROGRAM) || (current_bank != bank))
  {
    return 0xFFFFFFFFU;
  }

