MaJerle/stm32-usart-uart-dma-rx-tx/drivers/STM32C5xx_drivers/hal/stm32c5xx_hal_flash.c
  return prog_flash_addr;
}
#endif /* USE_HAL_FLASH_PROGRAM_BY_ADDR */

#if defined (USE_HAL_FLASH_ERASE_BY_ADDR) && (USE_HAL_FLASH_ERASE_BY_ADDR == 1)
/**
  * @brief  Get the last address erase operation information.
  *
  * @param  hflash   Pointer to a @ref hal_flash_handle_t structure.
  * @param  bank     This parameter can be one of the following values:
  *                      @arg @ref HAL_FLASH_BANK_1
  *                      @arg @ref HAL_FLASH_BANK_2
  * @note   This function must be called during or directly after a EraseByAddr operation, otherwise the returned
  *         information could not be true anymore.
  * @retval uint32_t Address of the FLASH page currently being erased.
  *                  0xFFFFFFFF if no erase page by address operation is ongoing on the given bank.
  */
uint32_t HAL_FLASH_GetCurrentErasedAddr(const hal_flash_handle_t *hflash, hal_flash_bank_t bank)
{
  ASSERT_DBG_PARAM(hflash != NULL);
  ASSERT_DBG_PARAM(IS_FLASH_BANK(bank));
  ASSERT_DBG_STATE(hflash->global_state, (uint32_t)HAL_FLASH_STATE_IDLE | (uint32_t)HAL_FLASH_STATE_ACTIVE);

  if ((hflash->ongoing_operation != HAL_FLASH_ADDR_ERASE) || (hflash->erase_bank != bank))
  {
    return 0xFFFFFFFFU;
  }

  return hflash->erase_page;
}
#endif /* USE_HAL_FLASH_ERASE_BY_ADDR */

#if defined (USE_HAL_FLASH_ERASE_PAGE) && (USE_HAL_FLASH_ERASE_PAGE == 1)
/**
  * @brief  Get the last page erase operation information.
  * @param  hflash   Pointer to a @ref hal_flash_handle_t structure.
  * @param  bank     This parameter can be one of the following values:
  *                      @arg @ref HAL_FLASH_BANK_1
  *                      @arg @ref HAL_FLASH_BANK_2
  *
  * @note   This function must be called during or directly after an ErasePage operation, otherwise the returned
  *         information could not be true anymore.
  *
  * @retval uint32_t FLASH page currently being erased.
  *                  0xFFFFFFFF if no erase page operation is ongoing on the given bank.
  */
uint32_t HAL_FLASH_GetCurrentErasedPage(const hal_flash_handle_t *hflash, hal_flash_bank_t bank)
{
  ASSERT_DBG_PARAM(hflash != NULL);
  ASSERT_DBG_PARAM(IS_FLASH_BANK(bank));
  ASSERT_DBG_STATE(hflash->global_state, (uint32_t)HAL_FLASH_STATE_IDLE | (uint32_t)HAL_FLASH_STATE_ACTIVE);

  if ((hflash->ongoing_operation != HAL_FLASH_PAGE_ERASE) || (hflash->erase_bank != bank))
  {
    return 0xFFFFFFFFU;
  }

  return FLASH_GET_HW_PAGE_INDEX(hflash->erase_page, FLASH_PAGE_NB);
}
#endif /* USE_HAL_FLASH_ERASE_PAGE */

/**
  * @brief   Get the interrupted operation information.
  * @param   hflash Pointer to a @ref hal_flash_handle_t structure.
  * @param   p_info Pointer to a @ref hal_flash_interrupted_by_reset_operation_info_t structure.
  * @warning Be aware that if the interrupted operation is either in the EDATA (with EDATA_EN set to 1) or OTP areas,
  *          the reported address is not always accurate due to a hardware limitation.
  *          Indeed, in this case, the correct address can be one of the following:
  *            - Reported address + 0x400
  *            - Reported address + 0x200
  *            - Reported address
  */
void HAL_FLASH_GetInterruptedByResetOperationInfo(const hal_flash_handle_t *hflash,
                                                  hal_flash_interrupted_by_reset_operation_info_t *p_info)
{
  uint32_t area_flag;
  uint32_t offset;
  uint32_t bank;

  ASSERT_DBG_PARAM(hflash != NULL);
  ASSERT_DBG_PARAM(p_info != NULL);
  ASSERT_DBG_STATE(hflash->global_state, (uint32_t)HAL_FLASH_STATE_IDLE | (uint32_t)HAL_FLASH_STATE_ACTIVE);

  STM32_UNUSED(hflash);

  p_info->operation = (hal_flash_interrupted_operation_t)LL_FLASH_GetOperInterruptedCode(FLASH_GET_INSTANCE(hflash));
  if (p_info->operation != HAL_FLASH_INTERRUPTED_NO_OPERATION)
  {
    offset = LL_FLASH_GetOperInterruptedAddressOffset(FLASH_GET_INSTANCE(hflash));
    area_flag = LL_FLASH_ReadFlag_OP(FLASH_GET_INSTANCE(hflash), LL_FLASH_FLAG_OP_AREA_ALL);
    if ((area_flag & LL_FLASH_FLAG_OTP_OP) != 0U)
    {
      p_info->addr  = FLASH_OTP_BASE;
      /* Convert 16-bit interface address offset to usual 128-bit interface address */
      p_info->addr += (((offset - FLASH_OTP_16BIT_OFFSET_BASE) % FLASH_16BIT_ROW_SIZE) << 2U) \
                      + (((offset - FLASH_OTP_16BIT_OFFSET_BASE) / FLASH_16BIT_ROW_SIZE) * FLASH_OTP_PAGE_SIZE);
    }
    else
    {
      /* Get the bank if not in OTP area */
      bank = (area_flag & LL_FLASH_FLAG_BK_OP);
      if ((area_flag & LL_FLASH_FLAG_DATA_OP) != 0U)
      {
#if defined(USE_HAL_FLASH_OB_EDATA) && (USE_HAL_FLASH_OB_EDATA == 1)
        p_info->addr = ((bank == 0U) ? FLASH_EDATA_BASE : (FLASH_EDATA_BASE + FLASH_EDATA_BANK_SIZE));
        /* Convert 16-bit interface address offset to usual 128-bit interface address */
        p_info->addr += ((offset % FLASH_16BIT_ROW_SIZE) << 2U) \
                        + ((offset / FLASH_16BIT_ROW_SIZE) * FLASH_EDATA_PAGE_SIZE);
#else
        p_info->addr = ((bank == 0U) ? FLASH_EXT_USER_BASE : (FLASH_EXT_USER_BASE + FLASH_EXT_USER_BANK_SIZE));
        p_info->addr += (offset << 4U);
#endif /* USE_HAL_FLASH_OB_EDATA */
      }
      else /* If no flag is set, select flash user area */
      {
        p_info->addr = ((bank == 0U) ? FLASH_BASE : (FLASH_BASE + FLASH_BANK_SIZE));
        p_info->addr += (offset << 4U);
      }
    }
  }
}

/**
  * @brief  Get the user FLASH info (size, number and size of banks, number and size of pages).
  * @param  hflash Pointer to a @ref hal_flash_handle_t structure.
  * @param  p_info Pointer to a @ref hal_flash_info_t structure.
  */
void HAL_FLASH_GetInfo(const hal_flash_handle_t *hflash, hal_flash_info_t *p_info)
{
  ASSERT_DBG_PARAM(hflash != NULL);
  ASSERT_DBG_PARAM(p_info != NULL);
  ASSERT_DBG_STATE(hflash->global_state, (uint32_t)HAL_FLASH_STATE_IDLE | (uint32_t)HAL_FLASH_STATE_ACTIVE);

#if defined(USE_HAL_FLASH_OB_EDATA) && (USE_HAL_FLASH_OB_EDATA == 1)
  p_info->flash_size_byte = FLASH_SIZE + FLASH_EDATA_SIZE;
#else
  p_info->flash_size_byte = FLASH_SIZE + FLASH_EXT_USER_SIZE;
#endif /* USE_HAL_FLASH_OB_EDATA */
  p_info->bank_nbr = FLASH_BANK_NB;

  for (uint32_t bank = 0; bank < FLASH_BANK_NB; bank++)
  {
    p_info->bank[bank].area_nbr = 2;
#if defined(USE_HAL_FLASH_OB_EDATA) && (USE_HAL_FLASH_OB_EDATA == 1)
    p_info->bank[bank].bank_size_byte = FLASH_BANK_SIZE + FLASH_EDATA_BANK_SIZE;
#else
    p_info->bank[bank].bank_size_byte = FLASH_BANK_SIZE + FLASH_EXT_USER_BANK_SIZE;
#endif /* USE_HAL_FLASH_OB_EDATA */
    /* USER flash area */
    p_info->bank[bank].user_flash.base_addr      = FLASH_BASE + (bank * FLASH_BANK_SIZE);
    p_info->bank[bank].user_flash.area_size_byte = FLASH_BANK_SIZE;
    p_info->bank[bank].user_flash.page_nbr       = (uint16_t)FLASH_PAGE_NB;

#if defined(USE_HAL_FLASH_OB_EDATA) && (USE_HAL_FLASH_OB_EDATA == 1)
    /* EDATA flash area */
    p_info->bank[bank].edata_flash.base_addr      = FLASH_EDATA_BASE + (bank * FLASH_EDATA_BANK_SIZE);
    p_info->bank[bank].edata_flash.area_size_byte = FLASH_EDATA_BANK_SIZE;
    p_info->bank[bank].edata_flash.page_nbr       = (uint16_t)FLASH_EDATA_PAGE_NB;
#else
    /* Extended USER flash area */
    p_info->bank[bank].ext_user_flash.base_addr      = FLASH_EXT_USER_BASE + (bank * FLASH_EXT_USER_BANK_SIZE);
    p_info->bank[bank].ext_user_flash.area_size_byte = FLASH_EXT_USER_BANK_SIZE;
    p_info->bank[bank].ext_user_flash.page_nbr       = (uint16_t)FLASH_EXT_USER_PAGE_NB;
#endif /* USE_HAL_FLASH_OB_EDATA */
  }

  STM32_UNUSED(hflash);
}

/**
  * @brief  Get the total FLASH size.
  * @param  hflash Pointer to a @ref hal_flash_handle_t structure.
  * @retval The size in bytes of total FLASH.
  */
uint32_t HAL_FLASH_GetSizeByte(const hal_flash_handle_t *hflash)
{
  ASSERT_DBG_PARAM(hflash != NULL);
  ASSERT_DBG_STATE(hflash->global_state, (uint32_t)HAL_FLASH_STATE_IDLE | (uint32_t)HAL_FLASH_STATE_ACTIVE);

  STM32_UNUSED(hflash);
#if defined(USE_HAL_FLASH_OB_EDATA) && (USE_HAL_FLASH_OB_EDATA == 1)
  return (FLASH_SIZE + FLASH_EDATA_SIZE);
#else
  return (FLASH_SIZE + FLASH_EXT_USER_SIZE);
#endif /* USE_HAL_FLASH_OB_EDATA */
}

/**
  * @brief  Get the number of FLASH banks.
  * @param  hflash Pointer to a @ref hal_flash_handle_t structure.
  * @retval The number of bank.
  */
uint8_t HAL_FLASH_GetBankNbr(const hal_flash_handle_t *hflash)
{
  ASSERT_DBG_PARAM(hflash != NULL);
  ASSERT_DBG_STATE(hflash->global_state, (uint32_t)HAL_FLASH_STATE_IDLE | (uint32_t)HAL_FLASH_STATE_ACTIVE);

  STM32_UNUSED(hflash);
  return (uint8_t) FLASH_BANK_NB;
}

/**
  * @brief  Get the total size in bytes of the given FLASH bank.
  * @param  hflash Pointer to a @ref hal_flash_handle_t structure.
  * @param  bank   This parameter can be one of the following values:
  *                    @arg @ref HAL_FLASH_BANK_1
  *                    @arg @ref HAL_FLASH_BANK_2
  * @retval The total size in bytes of the given bank.
  */
uint32_t HAL_FLASH_GetBankSizeByte(const hal_flash_handle_t *hflash, hal_flash_bank_t bank)
{
  ASSERT_DBG_PARAM(hflash != NULL);
  ASSERT_DBG_PARAM(IS_FLASH_BANK(bank));
  ASSERT_DBG_STATE(hflash->global_state, (uint32_t)HAL_FLASH_STATE_IDLE | (uint32_t)HAL_FLASH_STATE_ACTIVE);

  STM32_UNUSED(hflash);
  STM32_UNUSED(bank);

#if defined(USE_HAL_FLASH_OB_EDATA) && (USE_HAL_FLASH_OB_EDATA == 1)
  return (FLASH_BANK_SIZE + FLASH_EDATA_BANK_SIZE);
#else
  return (FLASH_BANK_SIZE + FLASH_EXT_USER_BANK_SIZE);
#endif /* USE_HAL_FLASH_OB_EDATA */
}


/**
  * @brief  Get the size in bytes of the user flash area of the given bank.
  * @param  hflash Pointer to a @ref hal_flash_handle_t structure.
  * @param  bank   This parameter can be one of the following values:
  *                    @arg @ref HAL_FLASH_BANK_1
  *                    @arg @ref HAL_FLASH_BANK_2
  * @retval The size in bytes of the user flash area of the given bank.
  */
uint32_t HAL_FLASH_GetUserFlashSizeByte(const hal_flash_handle_t *hflash, hal_flash_bank_t bank)
{
  ASSERT_DBG_PARAM(hflash != NULL);
  ASSERT_DBG_PARAM(IS_FLASH_BANK(bank));
  ASSERT_DBG_STATE(hflash->global_state, (uint32_t)HAL_FLASH_STATE_IDLE | (uint32_t)HAL_FLASH_STATE_ACTIVE);

  STM32_UNUSED(hflash);
  STM32_UNUSED(bank);

  return FLASH_BANK_SIZE;
}

#if defined(USE_HAL_FLASH_OB_EDATA) && (USE_HAL_FLASH_OB_EDATA == 1)
/**
  * @brief  Get the size in bytes of the EDATA flash area of the given bank.
  * @param  hflash Pointer to a @ref hal_flash_handle_t structure.
  * @param  bank   This parameter can be one of the following values:
  *                    @arg @ref HAL_FLASH_BANK_1
  *                    @arg @ref HAL_FLASH_BANK_2
  * @retval The size in bytes of the EDATA flash area of the given bank.
  */
uint32_t HAL_FLASH_EDATA_GetSizeByte(const hal_flash_handle_t *hflash, hal_flash_bank_t bank)
{
  ASSERT_DBG_PARAM(hflash != NULL);
  ASSERT_DBG_PARAM(IS_FLASH_BANK(bank));
  ASSERT_DBG_STATE(hflash->global_state, (uint32_t)HAL_FLASH_STATE_IDLE | (uint32_t)HAL_FLASH_STATE_ACTIVE);

  STM32_UNUSED(hflash);
  STM32_UNUSED(bank);

  return FLASH_EDATA_BANK_SIZE;
}
#else
/**
  * @brief  Get the size in bytes of the extended user flash area of the given bank.
  * @param  hflash Pointer to a @ref hal_flash_handle_t structure.
  * @param  bank   This parameter can be one of the following values:
  *                    @arg @ref HAL_FLASH_BANK_1
  *                    @arg @ref HAL_FLASH_BANK_2
  * @retval The size in bytes of the extended user flash area of the given bank.
  */
uint32_t HAL_FLASH_GetExtUserFlashSizeByte(const hal_flash_handle_t *hflash, hal_flash_bank_t bank)
{
  ASSERT_DBG_PARAM(hflash != NULL);
  ASSERT_DBG_PARAM(IS_FLASH_BANK(bank));
  ASSERT_DBG_STATE(hflash->global_state, (uint32_t)HAL_FLASH_STATE_IDLE | (uint32_t)HAL_FLASH_STATE_ACTIVE);

  STM32_UNUSED(hflash);
  STM32_UNUSED(bank);

  return FLASH_EXT_USER_BANK_SIZE;
}
#endif /* USE_HAL_FLASH_OB_EDATA */

/**
  * @brief  Get the number of pages of the user flash area of the given bank.
  * @param  hflash Pointer to a @ref hal_flash_handle_t structure.
  * @param  bank   This parameter can be one of the following values:
  *                    @arg @ref HAL_FLASH_BANK_1
  *                    @arg @ref HAL_FLASH_BANK_2
  * @retval The number of pages of the user flash area of the given bank.
  */
uint16_t HAL_FLASH_GetUserFlashPageNbr(const hal_flash_handle_t *hflash, hal_flash_bank_t bank)
{
  ASSERT_DBG_PARAM(hflash != NULL);
  ASSERT_DBG_PARAM(IS_FLASH_BANK(bank));
  ASSERT_DBG_STATE(hflash->global_state, (uint32_t)HAL_FLASH_STATE_IDLE | (uint32_t)HAL_FLASH_STATE_ACTIVE);

  STM32_UNUSED(hflash);
  STM32_UNUSED(bank);

  return (uint16_t) FLASH_PAGE_NB;
}

#if defined(USE_HAL_FLASH_OB_EDATA) && (USE_HAL_FLASH_OB_EDATA == 1)
/**
  * @brief  Get the number of pages of the EDATA flash area of the given bank.
  * @param  hflash Pointer to a @ref hal_flash_handle_t structure.
  * @param  bank   This parameter can be one of the following values:
  *                    @arg @ref HAL_FLASH_BANK_1
  *                    @arg @ref HAL_FLASH_BANK_2
  * @retval The number of pages of the EDATA flash area of the given bank.
  */
uint16_t HAL_FLASH_EDATA_GetPageNbr(const hal_flash_handle_t *hflash, hal_flash_bank_t bank)
{
  ASSERT_DBG_PARAM(hflash != NULL);
  ASSERT_DBG_PARAM(IS_FLASH_BANK(bank));
  ASSERT_DBG_STATE(hflash->global_state, (uint32_t)HAL_FLASH_STATE_IDLE | (uint32_t)HAL_FLASH_STATE_ACTIVE);

  STM32_UNUSED(hflash);
  STM32_UNUSED(bank);

  return (uint16_t) FLASH_EDATA_PAGE_NB;
}
#else
/**
  * @brief  Get the number of pages of the extended user flash area of the given bank.
  * @param  hflash Pointer to a @ref hal_flash_handle_t structure.
  * @param  bank   This parameter can be one of the following values:
  *                    @arg @ref HAL_FLASH_BANK_1
  *                    @arg @ref HAL_FLASH_BANK_2
  * @retval The number of pages of the extended user flash area of the given bank.
  */
uint16_t HAL_FLASH_GetExtUserFlashPageNbr(const hal_flash_handle_t *hflash, hal_flash_bank_t bank)
{
  ASSERT_DBG_PARAM(hflash != NULL);
  ASSERT_DBG_PARAM(IS_FLASH_BANK(bank));
  ASSERT_DBG_STATE(hflash->global_state, (uint32_t)HAL_FLASH_STATE_IDLE | (uint32_t)HAL_FLASH_STATE_ACTIVE);

  STM32_UNUSED(hflash);
  STM32_UNUSED(bank);

  return (uint16_t) FLASH_EXT_USER_PAGE_NB;
}
#endif /* USE_HAL_FLASH_OB_EDATA */

/**
  * @brief  Get the size in bytes of the given user area page.
  * @param  hflash Pointer to a @ref hal_flash_handle_t structure.
  * @param  bank   This parameter can be one of the following values:
  *                    @arg @ref HAL_FLASH_BANK_1
  *                    @arg @ref HAL_FLASH_BANK_2
  * @param  page   Selected page.
  * @retval The size in bytes of the given user area page.
  */
uint32_t HAL_FLASH_GetUserFlashPageSizeByte(const hal_flash_handle_t *hflash, hal_flash_bank_t bank, uint32_t page)
{
  ASSERT_DBG_PARAM(hflash != NULL);
  ASSERT_DBG_PARAM(IS_FLASH_BANK(bank));
  ASSERT_DBG_PARAM(page < FLASH_PAGE_NB);
  ASSERT_DBG_STATE(hflash->global_state, (uint32_t)HAL_FLASH_STATE_IDLE | (uint32_t)HAL_FLASH_STATE_ACTIVE);

  STM32_UNUSED(hflash);
  STM32_UNUSED(bank);
  STM32_UNUSED(page);

  return FLASH_PAGE_SIZE;
}

#if defined(USE_HAL_FLASH_OB_EDATA) && (USE_HAL_FLASH_OB_EDATA == 1)
/**
  * @brief  Get the size in bytes of the given EDATA area page.
  * @param  hflash Pointer to a @ref hal_flash_handle_t structure.
  * @param  bank   This parameter can be one of the following values:
  *                    @arg @ref HAL_FLASH_BANK_1
  *                    @arg @ref HAL_FLASH_BANK_2
  * @param  page   Selected page.
  * @retval The size in bytes of the given EDATA area page.
  */
uint32_t HAL_FLASH_EDATA_GetPageSizeByte(const hal_flash_handle_t *hflash, hal_flash_bank_t bank, uint32_t page)
{
  ASSERT_DBG_PARAM(hflash != NULL);
  ASSERT_DBG_PARAM(IS_FLASH_BANK(bank));
  ASSERT_DBG_PARAM(page < FLASH_EDATA_PAGE_NB);
  ASSERT_DBG_STATE(hflash->global_state, (uint32_t)HAL_FLASH_STATE_IDLE | (uint32_t)HAL_FLASH_STATE_ACTIVE);

  STM32_UNUSED(hflash);
  STM32_UNUSED(bank);
  STM32_UNUSED(page);

