MaJerle/stm32-usart-uart-dma-rx-tx/drivers/STM32C5xx_drivers/hal/stm32c5xx_hal_flash.c
  return FLASH_EDATA_PAGE_SIZE;
}
#else
/**
  * @brief  Get the size in bytes of the given extended user area page.
  * @param  hflash Pointer to a @ref hal_flash_handle_t structure.
  * @param  bank   This parameter can be one of the following values:
  *                    @arg @ref HAL_FLASH_BANK_1
  *                    @arg @ref HAL_FLASH_BANK_2
  * @param  page   Selected page
  * @retval The size in bytes of the given extended user area page.
  */
uint32_t HAL_FLASH_GetExtUserFlashPageSizeByte(const hal_flash_handle_t *hflash, hal_flash_bank_t bank, uint32_t page)
{
  ASSERT_DBG_PARAM(hflash != NULL);
  ASSERT_DBG_PARAM(IS_FLASH_BANK(bank));
  ASSERT_DBG_PARAM(page < FLASH_EXT_USER_PAGE_NB);
  ASSERT_DBG_STATE(hflash->global_state, (uint32_t)HAL_FLASH_STATE_IDLE | (uint32_t)HAL_FLASH_STATE_ACTIVE);

  STM32_UNUSED(hflash);
  STM32_UNUSED(bank);
  STM32_UNUSED(page);

  return FLASH_EXT_USER_PAGE_SIZE;
}
#endif /* USE_HAL_FLASH_OB_EDATA */

/**
  * @brief  Get the offset address of the given user area page.
  * @param  hflash  Pointer to a @ref hal_flash_handle_t structure.
  * @param  bank    This parameter can be one of the following values:
  *                     @arg @ref HAL_FLASH_BANK_1
  *                     @arg @ref HAL_FLASH_BANK_2
  * @param  page    Page within selected bank.
  * @retval Address The offset address of the given user area page.
  */
uint32_t HAL_FLASH_GetUserFlashAddrOffset(const hal_flash_handle_t *hflash, hal_flash_bank_t bank, uint32_t page)
{
  ASSERT_DBG_PARAM(hflash != NULL);
  ASSERT_DBG_PARAM(IS_FLASH_BANK(bank));
  ASSERT_DBG_PARAM(page < FLASH_PAGE_NB);
  ASSERT_DBG_STATE(hflash->global_state, (uint32_t)HAL_FLASH_STATE_IDLE | (uint32_t)HAL_FLASH_STATE_ACTIVE);

  STM32_UNUSED(hflash);

  return ((uint32_t)bank * FLASH_BANK_SIZE) + (page * FLASH_PAGE_SIZE);
}

#if defined(USE_HAL_FLASH_OB_EDATA) && (USE_HAL_FLASH_OB_EDATA == 1)
/**
  * @brief  Get the offset address of the given EDATA area page.
  * @param  hflash  Pointer to a @ref hal_flash_handle_t structure.
  * @param  bank    This parameter can be one of the following values:
  *                     @arg @ref HAL_FLASH_BANK_1
  *                     @arg @ref HAL_FLASH_BANK_2
  * @param  page    Page within selected bank.
  * @retval Address The offset address of the given EDATA area page.
  */
uint32_t HAL_FLASH_EDATA_GetAddrOffset(const hal_flash_handle_t *hflash, hal_flash_bank_t bank, uint32_t page)
{
  ASSERT_DBG_PARAM(hflash != NULL);
  ASSERT_DBG_PARAM(IS_FLASH_BANK(bank));
  ASSERT_DBG_PARAM(page < FLASH_EDATA_PAGE_NB);
  ASSERT_DBG_STATE(hflash->global_state, (uint32_t)HAL_FLASH_STATE_IDLE | (uint32_t)HAL_FLASH_STATE_ACTIVE);

  STM32_UNUSED(hflash);

  return ((uint32_t)bank * FLASH_EDATA_BANK_SIZE) + (page * FLASH_EDATA_PAGE_SIZE);
}
#else
/**
  * @brief  Get the offset address of the given extended user area page.
  * @param  hflash  Pointer to a @ref hal_flash_handle_t structure.
  * @param  bank    This parameter can be one of the following values:
  *                     @arg @ref HAL_FLASH_BANK_1
  *                     @arg @ref HAL_FLASH_BANK_2
  * @param  page    Page within selected bank.
  * @retval Address The offset address of the given extended user area page.
  */
uint32_t HAL_FLASH_GetExtUserFlashAddrOffset(const hal_flash_handle_t *hflash, hal_flash_bank_t bank, uint32_t page)
{
  ASSERT_DBG_PARAM(hflash != NULL);
  ASSERT_DBG_PARAM(IS_FLASH_BANK(bank));
  ASSERT_DBG_PARAM(page < FLASH_EXT_USER_PAGE_NB);
  ASSERT_DBG_STATE(hflash->global_state, (uint32_t)HAL_FLASH_STATE_IDLE | (uint32_t)HAL_FLASH_STATE_ACTIVE);

  STM32_UNUSED(hflash);

  return ((uint32_t)bank * FLASH_EXT_USER_BANK_SIZE) + (page * FLASH_EXT_USER_PAGE_SIZE);
}
#endif /* USE_HAL_FLASH_OB_EDATA */

#if defined (USE_HAL_FLASH_ECC) && (USE_HAL_FLASH_ECC == 1)
/**
  * @brief   Get the ECC information.
  * @param   hflash Pointer to a @ref hal_flash_handle_t structure.
  * @param   bank   This parameter can be one of the following values:
  *                    @arg @ref HAL_FLASH_BANK_1
  *                    @arg @ref HAL_FLASH_BANK_2
  * @param   p_info Pointer to a @ref hal_flash_ecc_info_t structure.
  * @warning Be aware that if the error is a ECC single error located either in the EDATA (with EDATA_EN set to 1)
  *          or OTP areas, the reported address is not always accurate due to a hardware limitation.
  *          Indeed, in this case, the correct address can be one of the following:
  *            - Reported address + 0x400
  *            - Reported address + 0x200
  *            - Reported address
  */
void HAL_FLASH_ECC_GetInfo(const hal_flash_handle_t *hflash, hal_flash_bank_t bank, hal_flash_ecc_info_t *p_info)
{
  uint32_t offset;
  uint32_t ecc_bank;
  uint32_t area_flag = 0U;
  uint32_t word_number = 0U;
  ASSERT_DBG_PARAM(hflash != NULL);
  ASSERT_DBG_PARAM(p_info != NULL);
  ASSERT_DBG_PARAM(IS_FLASH_BANK(bank));
  ASSERT_DBG_STATE(hflash->global_state, (uint32_t)HAL_FLASH_STATE_IDLE | (uint32_t)HAL_FLASH_STATE_ACTIVE);

  STM32_UNUSED(hflash);
  STM32_UNUSED(bank);

  if (LL_FLASH_IsActiveFlag_ECCD(FLASH_GET_INSTANCE(hflash)) != 0U)
  {
    p_info->type = HAL_FLASH_ECC_DOUBLE;
    p_info->status = HAL_FLASH_ECC_NOT_CORRECTED;

    offset = LL_FLASH_GetECCDAddressOffset(FLASH_GET_INSTANCE(hflash));
    /* get ECC error data information in case of double error detection*/
    word_number = LL_FLASH_GetECCDWordNumber(FLASH_GET_INSTANCE(hflash));
    p_info->data = LL_FLASH_GetECCDData(FLASH_GET_INSTANCE(hflash));

    area_flag = LL_FLASH_ReadFlag_ECCD(FLASH_GET_INSTANCE(hflash), LL_FLASH_FLAG_ECC_AREA_ALL);
  }
  else if (LL_FLASH_IsActiveFlag_ECCC(FLASH_GET_INSTANCE(hflash)) != 0U)
  {
    p_info->type = HAL_FLASH_ECC_SINGLE;
    p_info->status = HAL_FLASH_ECC_CORRECTED;
    offset = LL_FLASH_GetECCCAddressOffset(FLASH_GET_INSTANCE(hflash));
    /* No ECC error data information for single correction */
    p_info->data = 0U;

    area_flag = LL_FLASH_ReadFlag_ECCC(FLASH_GET_INSTANCE(hflash), LL_FLASH_FLAG_ECC_AREA_ALL);
  }
  else /* No ECC */
  {
    p_info->type = HAL_FLASH_ECC_NONE;
    return;
  }

  if ((area_flag & LL_FLASH_FLAG_OTP_ECC) != 0U)
  {
    p_info->addr  = FLASH_OTP_BASE;
    /* Convert 16-bit interface address offset to usual 128-bit interface address */
    p_info->addr += (((offset - FLASH_OTP_16BIT_OFFSET_BASE) % FLASH_16BIT_ROW_SIZE) << 2U) \
                    + (((offset - FLASH_OTP_16BIT_OFFSET_BASE) / FLASH_16BIT_ROW_SIZE) * FLASH_OTP_PAGE_SIZE) \
                    + ((word_number / 2U) * FLASH_OTP_16BIT_OFFSET_BASE) + ((word_number % 2UL) * 0x2UL);
  }
  else
  {
    /* Get the ECC error bank if not in OTP area */
    ecc_bank = (area_flag & LL_FLASH_FLAG_BK_ECC);
    if ((area_flag & LL_FLASH_FLAG_SYSF_ECC) != 0U) /* System FLASH */
    {
      p_info->addr = ((ecc_bank == 0U) ? FLASH_SYSTEM_BASE : (FLASH_SYSTEM_BASE + (FLASH_SYSTEM_SIZE >> 1U)));
      p_info->addr += (offset << 4U);
    }
    else if ((area_flag & LL_FLASH_FLAG_EDATA_ECC) != 0U)
    {
#if defined(USE_HAL_FLASH_OB_EDATA) && (USE_HAL_FLASH_OB_EDATA == 1)
      p_info->addr = ((ecc_bank == 0U) ? FLASH_EDATA_BASE : (FLASH_EDATA_BASE + FLASH_EDATA_BANK_SIZE));
      /* Convert 16-bit interface address offset to usual 128-bit interface address */
      p_info->addr += ((offset % FLASH_16BIT_ROW_SIZE) << 2U) \
                      + ((offset / FLASH_16BIT_ROW_SIZE) * FLASH_EDATA_PAGE_SIZE) \
                      + ((word_number / 2U) * FLASH_OTP_16BIT_OFFSET_BASE) + ((word_number % 2UL) * 0x2UL);
#else
      p_info->addr = ((ecc_bank == 0U) ? FLASH_EXT_USER_BASE : (FLASH_EXT_USER_BASE + FLASH_EXT_USER_BANK_SIZE));
      p_info->addr += (offset << 4U);
#endif /* USE_HAL_FLASH_OB_EDATA */
    }
    else /* User FLASH */
    {
      p_info->addr = ((ecc_bank == 0U) ? FLASH_BASE : (FLASH_BASE + FLASH_BANK_SIZE));
      p_info->addr += (offset << 4U);
    }
  }
}
#endif /* USE_HAL_FLASH_ECC */

/**
  * @brief  Get the HAL FLASH instance.
  * @param  hflash Pointer to a @ref hal_flash_handle_t structure.
  * @retval The HAL FLASH instance.
  */
hal_flash_t HAL_FLASH_GetInstance(const hal_flash_handle_t *hflash)
{
  ASSERT_DBG_PARAM(hflash != NULL);
  ASSERT_DBG_PARAM(IS_FLASH_INSTANCE(FLASH_GET_INSTANCE(hflash)));

  return (hflash->instance);
}

/**
  * @brief  Get the hardware FLASH instance.
  * @param  hflash Pointer to a @ref hal_flash_handle_t structure.
  * @retval The hardware FLASH instance.
  */
FLASH_TypeDef *HAL_FLASH_GetLLInstance(const hal_flash_handle_t *hflash)
{
  ASSERT_DBG_PARAM(hflash != NULL);
  ASSERT_DBG_PARAM(IS_FLASH_INSTANCE(FLASH_GET_INSTANCE(hflash)));

  return ((FLASH_TypeDef *)((uint32_t)((hflash)->instance)));
}

/**
  * @brief  Get the FLASH current state.
  * @param  hflash Pointer to a @ref hal_flash_handle_t structure.
  * @retval State  The FLASH global state.
  */
hal_flash_state_t HAL_FLASH_GetState(const hal_flash_handle_t *hflash)
{
  ASSERT_DBG_PARAM(hflash != NULL);

