MaJerle/stm32-usart-uart-dma-rx-tx/drivers/STM32C5xx_drivers/hal/stm32c5xx_hal_flash.c
  return (hflash->global_state);
}

#if defined(USE_HAL_FLASH_GET_LAST_ERRORS) && (USE_HAL_FLASH_GET_LAST_ERRORS == 1)
/**
  * @brief  Get the FLASH last error codes.
  * @param  hflash      Pointer to a @ref hal_flash_handle_t structure.
  * @retval Error codes The FLASH last error codes.
  */
uint32_t HAL_FLASH_GetLastErrorCodes(const hal_flash_handle_t *hflash)
{
  ASSERT_DBG_PARAM(hflash != NULL);

  return (hflash->last_error_codes);
}
#endif /* USE_HAL_FLASH_GET_LAST_ERRORS */

#if defined (USE_HAL_FLASH_USER_DATA) && (USE_HAL_FLASH_USER_DATA == 1)
/**
  * @brief  Store User Data pointer within the FLASH handle.
  * @param  hflash      Pointer to a @ref hal_flash_handle_t structure.
  * @param  p_user_data Pointer to the user data.
  */
void HAL_FLASH_SetUserData(hal_flash_handle_t *hflash, const void *p_user_data)
{
  ASSERT_DBG_PARAM(hflash != NULL);

  hflash->p_user_data = p_user_data;
}

/**
  * @brief  Retrieve the user data pointer from the FLASH handle.
  * @param  hflash  Pointer to a @ref hal_flash_handle_t structure.
  * @retval Pointer to the user data.
  */
const void *HAL_FLASH_GetUserData(const hal_flash_handle_t *hflash)
{
  ASSERT_DBG_PARAM(hflash != NULL);

  return (hflash->p_user_data);
}
#endif /* USE_HAL_FLASH_USER_DATA */

/**
  * @}
  */

/**
  * @}
  */

/** @addtogroup FLASH_Private_Functions
  * @{
  */

#if (defined (USE_HAL_FLASH_PROGRAM_BY_ADDR) && (USE_HAL_FLASH_PROGRAM_BY_ADDR == 1)) \
    || (defined (USE_HAL_FLASH_ERASE_BY_ADDR) && (USE_HAL_FLASH_ERASE_BY_ADDR == 1)) \
    || (defined (USE_HAL_FLASH_ERASE_PAGE) && (USE_HAL_FLASH_ERASE_PAGE == 1)) \
    || (defined (USE_HAL_FLASH_ERASE_BANK) && (USE_HAL_FLASH_ERASE_BANK == 1)) \
    || (defined (USE_HAL_FLASH_MASS_ERASE) && (USE_HAL_FLASH_MASS_ERASE == 1))
/**
  * @brief  Check if the FLASH operation for a new operation.
  * @param  hflash       Pointer to a @ref hal_flash_handle_t structure.
  * @retval HAL_BUSY     FLASH is busy.
  * @retval HAL_ERROR    FLASH is locked or an error is pending.
  * @retval HAL_OK       FLASH is ready.
  */
static hal_status_t FLASH_IsReadyForOperation(hal_flash_handle_t *hflash)
{
  uint32_t flags = LL_FLASH_ReadFlag(FLASH_GET_INSTANCE(hflash), LL_FLASH_FLAG_STATUS_ALL | LL_FLASH_FLAG_ERRORS_ALL);

  if ((LL_FLASH_IsLocked(FLASH_GET_INSTANCE(hflash)) != 0U) || ((flags & LL_FLASH_FLAG_ERRORS_ALL) != 0U))
  {
    return HAL_ERROR;
  }
  else if ((flags & LL_FLASH_FLAG_STATUS_ALL) != 0U)
  {
    return HAL_BUSY;
  }
  else
  {
    return HAL_OK;
  }
}
#endif /* USE_HAL_FLASH_PROGRAM_BY_ADDR || USE_HAL_FLASH_ERASE_BY_ADDR || USE_HAL_FLASH_ERASE_PAGE
          || USE_HAL_FLASH_ERASE_BANK || USE_HAL_FLASH_MASS_ERASE */

/**
  * @brief  Wait for a FLASH operation to complete.
  * @param  hflash       Pointer to a @ref hal_flash_handle_t structure.
  * @param  timeout_ms   Maximum flash operation timeout..
  * @retval HAL_TIMEOUT  User timeout.
  * @retval HAL_ERROR    Error during operation.
  * @retval HAL_OK       No operation to be waiting.
  */
static hal_status_t FLASH_WaitForEndOfOperation(hal_flash_handle_t *hflash, uint32_t timeout_ms)
{
  uint32_t tickstart;
  uint32_t error_code;

  tickstart = HAL_GetTick();
  while (LL_FLASH_IsActiveFlag(FLASH_GET_INSTANCE(hflash), LL_FLASH_FLAG_STATUS_ALL) != 0U)
  {
    if (timeout_ms != HAL_MAX_DELAY)
    {
      if (((HAL_GetTick() - tickstart) > timeout_ms) || (timeout_ms == 0U))
      {
        if (LL_FLASH_IsActiveFlag(FLASH_GET_INSTANCE(hflash), LL_FLASH_FLAG_STATUS_ALL) != 0U)
        {
          return HAL_TIMEOUT;
        }
      }
    }
  }

  error_code = LL_FLASH_ReadFlag(FLASH_GET_INSTANCE(hflash), LL_FLASH_FLAG_ERRORS_ALL);

  if (error_code != 0U)
  {
#if defined (USE_HAL_FLASH_GET_LAST_ERRORS) && (USE_HAL_FLASH_GET_LAST_ERRORS == 1)
    /* Fill the FLASH handle with the detected error codes */
    FLASH_FillErrorCode(hflash, error_code);
#endif /* USE_HAL_FLASH_GET_LAST_ERRORS */

    /* Check error flags */
    LL_FLASH_ClearFlag(FLASH_GET_INSTANCE(hflash), LL_FLASH_FLAG_ERRORS_ALL);

    return HAL_ERROR;
  }

  /* Clear FLASH End of Operation pending bit */
  LL_FLASH_ClearFlag_EOP(FLASH_GET_INSTANCE(hflash));

  /* If no error flag is set */
  return HAL_OK;
}

#if defined (USE_HAL_FLASH_PROGRAM_BY_ADDR) && (USE_HAL_FLASH_PROGRAM_BY_ADDR == 1)

/**
  * @brief  Get the program unit function according to given programming mode.
  * @param  programming_mode This parameter can be one element of the @ref hal_flash_program_mode_t enumeration.
  * @retval Pointer to the program unit function.
  */
static hal_flash_program_unit_func_t FLASH_GetProgramUnitFunction(hal_flash_program_mode_t programming_mode)
{
  hal_flash_program_unit_func_t p_prog_unit_func;
  if (FLASH_GET_PROGRAM_SIZE(programming_mode) >= FLASH_WORD_SIZE_BYTE)
  {
    /* Program by successive 32-bit accesses */
    p_prog_unit_func = FLASH_ProgramByWord;
  }
  else if (programming_mode == HAL_FLASH_PROGRAM_HALFWORD)
  {
    /* Program by successive 16-bit accesses */
    p_prog_unit_func = FLASH_ProgramByHalfWord;
  }
  else
  {
    /* Program by successive 8-bit accesses */
    p_prog_unit_func = FLASH_ProgramByByte;
  }

  return p_prog_unit_func;
}

/**
  * @brief  Update the adaptive programming mode and compute the number of elementary writes to perform.
  * @param  hflash   Pointer to a @ref hal_flash_handle_t structure.
  */
static void FLASH_UpdateAdaptiveProgMode(hal_flash_handle_t *hflash)
{
  hal_flash_program_mode_t programming_mode;
  uint32_t count = hflash->count;
  hal_flash_program_unit_func_t p_prog_unit_func;

  if (FLASH_IsFlashUSERAddr(hflash->prog_flash_addr, 1U) != 0U)
  {
    if (count >= FLASH_QUADWORD_SIZE_BYTE)
    {
      programming_mode = HAL_FLASH_PROGRAM_QUADWORD;
      count = FLASH_QUADWORD_SIZE_BYTE;
      p_prog_unit_func = FLASH_ProgramByWord;
    }
    else
    {
      programming_mode = (((count % FLASH_DOUBLEWORD_SIZE_BYTE) == 0U) ? HAL_FLASH_PROGRAM_DOUBLEWORD :
                          (((count % FLASH_WORD_SIZE_BYTE) == 0U) ? HAL_FLASH_PROGRAM_WORD :
                           (((count % FLASH_HALFWORD_SIZE_BYTE) == 0U) ? HAL_FLASH_PROGRAM_HALFWORD :
                            HAL_FLASH_PROGRAM_BYTE)));
      p_prog_unit_func = FLASH_GetProgramUnitFunction(programming_mode);
    }
  }
  else
  {
    if ((count % FLASH_WORD_SIZE_BYTE) == 0U)
    {
      programming_mode = HAL_FLASH_PROGRAM_WORD;
      count = FLASH_WORD_SIZE_BYTE;
      p_prog_unit_func = FLASH_ProgramByWord;
    }
    else
    {
      programming_mode = HAL_FLASH_PROGRAM_HALFWORD;
      count = FLASH_HALFWORD_SIZE_BYTE;
      p_prog_unit_func = FLASH_ProgramByHalfWord;
    }
  }

  hflash->programming_mode = programming_mode;
  hflash->prog_size_byte = count;
  hflash->p_prog_unit_func = p_prog_unit_func;
}

/**
  * @brief  Program up to a quad-word (128-bit) at a specified address by successive write operations in polling mode.
  * @param  hflash      Pointer to a @ref hal_flash_handle_t structure.
  * @param  flash_addr  FLASH address to program.
  * @param  p_data      Pointer to the data to be programmed.
  * @param  size_byte   Size of the data to be programmed.
  * @param  timeout_ms  Maximum user timeout value for program operation in milliseconds.
  * @retval HAL_ERROR   Error during programming.
  * @retval HAL_TIMEOUT User timeout.
  * @retval HAL_BUSY    FLASH is busy and cannot start a new program operation.
  * @retval HAL_OK      No operation to be waiting.
  */
static hal_status_t FLASH_Program(hal_flash_handle_t *hflash,
                                  uint32_t flash_addr,
                                  const uint32_t *p_data,
                                  uint32_t size_byte,
                                  uint32_t timeout_ms)
{
  uint32_t prog_size;
  uint32_t tickstart = HAL_GetTick();

