MaJerle/stm32-usart-uart-dma-rx-tx/drivers/STM32C5xx_drivers/hal/stm32c5xx_hal_flash.c
  hal_status_t status = FLASH_IsReadyForOperation(hflash);

  if (status == HAL_OK)
  {
    HAL_CHECK_UPDATE_STATE(hflash, global_state, HAL_FLASH_STATE_IDLE, HAL_FLASH_STATE_ACTIVE);

#if defined (USE_HAL_FLASH_GET_LAST_ERRORS) && (USE_HAL_FLASH_GET_LAST_ERRORS == 1)
    hflash->last_error_codes = HAL_FLASH_ERROR_NONE;
#endif /* USE_HAL_FLASH_GET_LAST_ERRORS */

    /* Fill the operation information in the handle */
    hflash->ongoing_operation = HAL_FLASH_PROGRAM;
    hflash->prog_data_addr    = (uint32_t)p_data;
    hflash->prog_flash_addr   = flash_addr;
    hflash->count             = size_byte;
    hflash->size              = size_byte;

    LL_FLASH_EnableProgramming(FLASH_GET_INSTANCE(hflash));

    while ((hflash->count > 0U) && (status == HAL_OK))
    {
      if (hflash->is_adaptive_prog != 0U)
      {
        FLASH_UpdateAdaptiveProgMode(hflash);
      }

      hflash->p_prog_unit_func(hflash);

      status = FLASH_WaitForEndOfOperation(hflash, FLASH_PROGRAM_OPERATION_QUADWORD_TIMEOUT);

      /* Update handle programming elements and reset programming flags if no error occurred */
      if (status == HAL_OK)
      {
        prog_size = hflash->prog_size_byte;

        if (hflash->count > prog_size)
        {
          hflash->count           -= prog_size;
          hflash->prog_data_addr  += prog_size;
          hflash->prog_flash_addr += prog_size;
        }
        else
        {
          hflash->count = 0U;
          hflash->prog_data_addr  += (prog_size - 1U);
          hflash->prog_flash_addr += (prog_size - 1U);
        }

        if ((hflash->count > 0U) && (timeout_ms != HAL_MAX_DELAY))
        {
          if (((HAL_GetTick() - tickstart) > timeout_ms) || (timeout_ms == 0U))
          {
            status = HAL_TIMEOUT;
          }
        }
      }
    }

    LL_FLASH_DisableProgramming(FLASH_GET_INSTANCE(hflash));

    hflash->ongoing_operation = HAL_FLASH_NO_OPERATION;
    hflash->global_state = HAL_FLASH_STATE_IDLE;
  }

  return status;
}

/**
  * @brief  Program up to a quad-word (128-bit) at a specified address by successive write operations.
  * @param  hflash          Pointer to a @ref hal_flash_handle_t structure.
  * @param  flash_addr      FLASH address to program.
  * @param  p_data          Pointer to the data to be programmed.
  * @param  size_byte       Size of the data to be programmed.
  * @retval HAL_ERROR       Error before starting program operation.
  * @retval HAL_BUSY        FLASH is busy and cannot start a new program operation.
  * @retval HAL_OK          Program operation started.
  */
static hal_status_t FLASH_Program_IT(hal_flash_handle_t *hflash,
                                     uint32_t flash_addr,
                                     const uint32_t *p_data,
                                     uint32_t size_byte)
{
  hal_status_t status = FLASH_IsReadyForOperation(hflash);

  if (status == HAL_OK)
  {
    HAL_CHECK_UPDATE_STATE(hflash, global_state, HAL_FLASH_STATE_IDLE, HAL_FLASH_STATE_ACTIVE);

#if defined (USE_HAL_FLASH_GET_LAST_ERRORS) && (USE_HAL_FLASH_GET_LAST_ERRORS == 1)
    hflash->last_error_codes = HAL_FLASH_ERROR_NONE;
#endif /* USE_HAL_FLASH_GET_LAST_ERRORS */

    /* Fill the operation information structure */
    hflash->ongoing_operation = HAL_FLASH_PROGRAM;
    hflash->prog_data_addr    = (uint32_t)p_data;
    hflash->prog_flash_addr   = flash_addr;
    hflash->count             = size_byte;
    hflash->size              = size_byte;

    LL_FLASH_EnableProgramming(FLASH_GET_INSTANCE(hflash));

    if (hflash->is_adaptive_prog != 0U)
    {
      FLASH_UpdateAdaptiveProgMode(hflash);
    }

    LL_FLASH_ClearFlag_EOP(FLASH_GET_INSTANCE(hflash));
    LL_FLASH_EnableIT(FLASH_GET_INSTANCE(hflash), LL_FLASH_IT_ALL);

    hflash->p_prog_unit_func(hflash);
  }

  return status;
}

/**
  * @brief  Program up to a quad-word (128-bit) at a specified address by successive word write operations.
  * @param  hflash Pointer to a @ref hal_flash_handle_t structure.
  */
static void FLASH_ProgramByWord(hal_flash_handle_t *hflash)
{
  uint32_t increment_index = hflash->prog_size_byte / FLASH_WORD_SIZE_BYTE;
  uint32_t *dest_addr      = (uint32_t *)(hflash->prog_flash_addr);
  uint32_t *src_addr       = (uint32_t *)(hflash->prog_data_addr);
  uint32_t primask_bit;

  /* Enter critical section: Disable interrupts to avoid any interruption during the loop */
  primask_bit = __get_PRIMASK();
  __disable_irq();

  /* Program */
  do
  {
    *dest_addr = *src_addr;
    dest_addr++;
    src_addr++;
    increment_index--;
  } while (increment_index != 0U);

  /* Set FW bit when less than a quad-word is written */
  if (hflash->programming_mode != HAL_FLASH_PROGRAM_QUADWORD)
  {
    LL_FLASH_EnableForceWrite(FLASH_GET_INSTANCE(hflash));
  }
  /* Exit critical section: restore previous priority mask */
  __set_PRIMASK(primask_bit);
}

/**
  * @brief  Program up to a quad-word (128-bit) at a specified address by successive word write operations.
  * @param  hflash Pointer to a @ref hal_flash_handle_t structure.
  */
static void FLASH_ProgramByHalfWord(hal_flash_handle_t *hflash)
{
  uint32_t increment_index = hflash->prog_size_byte / FLASH_HALFWORD_SIZE_BYTE;
  uint32_t primask_bit;
  uint16_t *dest_addr = (uint16_t *)(hflash->prog_flash_addr);
  uint16_t *src_addr  = (uint16_t *)(hflash->prog_data_addr);

  /* Enter critical section: Disable interrupts to avoid any interruption during the loop */
  primask_bit = __get_PRIMASK();
  __disable_irq();

  /* Program */
  do
  {
    *dest_addr = *src_addr;
    dest_addr++;
    src_addr++;
    increment_index--;
  } while (increment_index != 0U);

  /* Set FW bit when less than a quad-word is written */
  if ((FLASH_IsFlashUSERAddr(hflash->prog_flash_addr, 1U) != 0U))
  {
    LL_FLASH_EnableForceWrite(FLASH_GET_INSTANCE(hflash));
  }
  /* Exit critical section: restore previous priority mask */
  __set_PRIMASK(primask_bit);
}

/**
  * @brief  Program up to a quad-word (128-bit) at a specified address by successive byte write operations.
  * @param  hflash Pointer to a @ref hal_flash_handle_t structure.
  */
static void FLASH_ProgramByByte(hal_flash_handle_t *hflash)
{
  uint32_t increment_index = hflash->prog_size_byte;
  uint32_t primask_bit;
  uint8_t *dest_addr = (uint8_t *)(hflash->prog_flash_addr);
  uint8_t *src_addr  = (uint8_t *)(hflash->prog_data_addr);

  /* Enter critical section: Disable interrupts to avoid any interruption during the loop */
  primask_bit = __get_PRIMASK();
  __disable_irq();

  /* Program */
  do
  {
    *dest_addr = *src_addr;
    dest_addr++;
    src_addr++;
    increment_index--;
  } while (increment_index != 0U);

