MaJerle/stm32-usart-uart-dma-rx-tx/drivers/STM32C5xx_drivers/hal/stm32c5xx_hal_flash.c
  /* Set FW bit when less than a quad-word is written */
  if (FLASH_IsFlashUSERAddr(hflash->prog_flash_addr, 1U) != 0U)
  {
    LL_FLASH_EnableForceWrite(FLASH_GET_INSTANCE(hflash));
  }
  /* Exit critical section: restore previous priority mask */
  __set_PRIMASK(primask_bit);
}
#endif /* USE_HAL_FLASH_PROGRAM_BY_ADDR */

#if defined (USE_HAL_FLASH_ERASE_BY_ADDR) && (USE_HAL_FLASH_ERASE_BY_ADDR == 1)
/**
  * @brief Get the size in bytes of the page which contains the given flash address.
  * @param flash_addr Address of the page
  * @retval The size of the page containing the given address.
  */
static uint32_t FLASH_GetPageSizeByAddr(uint32_t flash_addr)
{
  uint32_t page_size;

  if ((flash_addr >= FLASH_BASE) && (flash_addr < (FLASH_BASE + FLASH_SIZE))) /* Main User Flash*/
  {
    page_size = FLASH_PAGE_SIZE;
  }
  else
  {
#if defined(USE_HAL_FLASH_OB_EDATA) && (USE_HAL_FLASH_OB_EDATA == 1)
    page_size = FLASH_EDATA_PAGE_SIZE;
#else
    page_size = FLASH_EXT_USER_PAGE_SIZE;
#endif /* USE_HAL_FLASH_OB_EDATA */
  }

  return page_size;
}

/**
  * @brief Get the page index associated to the given flash address.
  * @param flash_addr Flash Address.
  * @retval uint32_t The index of the page containing the given address.
  */
static uint32_t FLASH_GetPageIndexByAddr(uint32_t flash_addr)
{
  uint32_t max_page_index;
  uint32_t page_index;

  if ((flash_addr >= FLASH_BASE) && (flash_addr < (FLASH_BASE + FLASH_SIZE))) /* Main User Flash*/
  {
    page_index = (((flash_addr - FLASH_BASE) / FLASH_PAGE_SIZE));
    max_page_index = FLASH_PAGE_NB;
  }
  else
  {
#if defined(USE_HAL_FLASH_OB_EDATA) && (USE_HAL_FLASH_OB_EDATA == 1)
    /* EDATA area configured as data flash */
    page_index = ((flash_addr - FLASH_EDATA_BASE) / FLASH_EDATA_PAGE_SIZE);
    max_page_index = FLASH_EDATA_PAGE_NB;
#else
    /* EDATA area configured as user flash */
    page_index = ((flash_addr - FLASH_EXT_USER_BASE) / FLASH_EXT_USER_PAGE_SIZE);
    max_page_index = FLASH_EXT_USER_PAGE_NB;
#endif /* USE_HAL_FLASH_OB_EDATA */
  }

  return FLASH_GET_HW_PAGE_INDEX(page_index, max_page_index);
}

/**
  * @brief  Erase pages of FLASH memory by address in polling mode.
  * @param  hflash      Pointer to a @ref hal_flash_handle_t structure.
  * @param  flash_addr  FLASH address to erase.
  * @param  size_byte   Size of the data to be erased.
  * @param  page_size   Page size of the erased area.
  * @param  timeout_ms  Maximum user timeout value for erase operation in milliseconds.
  * @retval HAL_ERROR   Error during erasing.
  * @retval HAL_TIMEOUT User timeout.
  * @retval HAL_BUSY    FLASH is busy and cannot start a new erase operation.
  * @retval HAL_OK      No operation to be waiting.
  */
static hal_status_t FLASH_EraseAddr(hal_flash_handle_t *hflash,
                                    uint32_t flash_addr,
                                    uint32_t size_byte,
                                    uint32_t page_size,
                                    uint32_t timeout_ms)
{
  uint32_t erased_size;
  uint32_t tickstart;
  uint32_t erase_area;
  hal_status_t status = FLASH_IsReadyForOperation(hflash);

  if (status == HAL_OK)
  {
    HAL_CHECK_UPDATE_STATE(hflash, global_state, HAL_FLASH_STATE_IDLE, HAL_FLASH_STATE_ACTIVE);

#if defined (USE_HAL_FLASH_GET_LAST_ERRORS) && (USE_HAL_FLASH_GET_LAST_ERRORS == 1)
    hflash->last_error_codes = HAL_FLASH_ERROR_NONE;
#endif /* USE_HAL_FLASH_GET_LAST_ERRORS */

    /* Fill the operation information structure */
    hflash->ongoing_operation = HAL_FLASH_ADDR_ERASE;
    hflash->erase_bank = FLASH_GetBank(hflash, flash_addr);
    hflash->erase_page = flash_addr;
    hflash->count      = size_byte;
    hflash->size       = size_byte;
    erased_size = page_size - (hflash->erase_page % page_size);
    erase_area  = FLASH_GET_ERASE_AREA_ADDR(hflash->erase_page);

    while ((hflash->count > 0U) && (status == HAL_OK))
    {
      tickstart = HAL_GetTick();

      LL_FLASH_StartErasePage(FLASH_GET_INSTANCE(hflash), FLASH_GET_ERASE_BANK(hflash->erase_bank), \
                              erase_area, FLASH_GetPageIndexByAddr(hflash->erase_page));

      status = FLASH_WaitForEndOfOperation(hflash, FLASH_ERASE_PAGE_OPERATION_TIMEOUT);

      if (status == HAL_OK)
      {
        if (hflash->count > erased_size)
        {
          hflash->count -= erased_size;
          hflash->erase_page += erased_size;
          erased_size = page_size;
        }
        else
        {
          erased_size = hflash->count;
          hflash->erase_page += erased_size - 1U;
          hflash->count = 0U;
        }

        if ((hflash->count > 0U) && (timeout_ms != HAL_MAX_DELAY))
        {
          if (((HAL_GetTick() - tickstart) > timeout_ms) || (timeout_ms == 0U))
          {
            status = HAL_TIMEOUT;
          }
        }
      }
    }

    LL_FLASH_DisablePageErase(FLASH_GET_INSTANCE(hflash));

    hflash->ongoing_operation = HAL_FLASH_NO_OPERATION;
    hflash->global_state = HAL_FLASH_STATE_IDLE;
  }

  return status;
}

/**
  * @brief  Erase pages of FLASH memory by address in interrupt mode.
  * @param  hflash         Pointer to a @ref hal_flash_handle_t structure.
  * @param  flash_addr     FLASH address to erase.
  * @param  size_byte      Size of the data to be erased.
  * @retval HAL_ERROR      Error during erasing.
  * @retval HAL_BUSY       FLASH is busy and cannot start a new erase operation.
  * @retval HAL_OK         No operation to be waiting.
  */
static hal_status_t FLASH_EraseAddr_IT(hal_flash_handle_t *hflash,
                                       uint32_t flash_addr,
                                       uint32_t size_byte)
{
  hal_status_t status = FLASH_IsReadyForOperation(hflash);
  uint32_t erase_area = FLASH_GET_ERASE_AREA_ADDR(flash_addr);

  if (status == HAL_OK)
  {
    HAL_CHECK_UPDATE_STATE(hflash, global_state, HAL_FLASH_STATE_IDLE, HAL_FLASH_STATE_ACTIVE);
#if defined (USE_HAL_FLASH_GET_LAST_ERRORS) && (USE_HAL_FLASH_GET_LAST_ERRORS == 1)
    hflash->last_error_codes = HAL_FLASH_ERROR_NONE;
#endif /* USE_HAL_FLASH_GET_LAST_ERRORS */

