MaJerle/stm32-usart-uart-dma-rx-tx/drivers/STM32C5xx_drivers/hal/stm32c5xx_hal_flash.c
    /* Fill the operation information structure */
    hflash->ongoing_operation = HAL_FLASH_ADDR_ERASE;
    hflash->erase_bank = FLASH_GetBank(hflash, flash_addr);
    hflash->erase_page = flash_addr;
    hflash->count      = size_byte;
    hflash->size       = size_byte;

    LL_FLASH_ClearFlag_EOP(FLASH_GET_INSTANCE(hflash));
    LL_FLASH_EnableIT(FLASH_GET_INSTANCE(hflash), LL_FLASH_IT_ALL);
    LL_FLASH_StartErasePage(FLASH_GET_INSTANCE(hflash), FLASH_GET_ERASE_BANK(hflash->erase_bank), \
                            erase_area, FLASH_GetPageIndexByAddr(hflash->erase_page));
  }

  return status;
}
#endif /* USE_HAL_FLASH_ERASE_BY_ADDR */

#if defined (USE_HAL_FLASH_ERASE_PAGE) && (USE_HAL_FLASH_ERASE_PAGE == 1)
/**
  * @brief  Erase pages of FLASH memory by address in polling mode.
  * @param  hflash       Pointer to a @ref hal_flash_handle_t structure.
  * @param  bank         Bank to erase.
  *                      This parameter can be one of the following values:
  *                          @arg @ref HAL_FLASH_BANK_1
  *                          @arg @ref HAL_FLASH_BANK_2
  * @param  start_page   Index of the first page to erase.
  * @param  page_nbr     The number of pages to erase.
  * @param  erase_area   Area to erase.
  * @param  timeout_ms   Maximum user timeout value for erase operation in milliseconds.
  * @retval HAL_ERROR    Error during erasing.
  * @retval HAL_TIMEOUT  User timeout.
  * @retval HAL_BUSY     FLASH is busy and cannot start a new erase operation.
  * @retval HAL_OK       No operation to be waiting.
  */
static hal_status_t FLASH_ErasePage(hal_flash_handle_t *hflash,
                                    hal_flash_bank_t bank,
                                    uint32_t start_page,
                                    uint32_t page_nbr,
                                    uint32_t erase_area,
                                    uint32_t timeout_ms)
{
  uint32_t tickstart;
  hal_status_t status = FLASH_IsReadyForOperation(hflash);

  if (status == HAL_OK)
  {
    HAL_CHECK_UPDATE_STATE(hflash, global_state, HAL_FLASH_STATE_IDLE, HAL_FLASH_STATE_ACTIVE);

#if defined (USE_HAL_FLASH_GET_LAST_ERRORS) && (USE_HAL_FLASH_GET_LAST_ERRORS == 1)
    hflash->last_error_codes = HAL_FLASH_ERROR_NONE;
#endif /* USE_HAL_FLASH_GET_LAST_ERRORS */

    /* Fill the operation information structure */
    hflash->ongoing_operation = HAL_FLASH_PAGE_ERASE;
    hflash->erase_bank = bank;
    hflash->erase_page = start_page;
    hflash->count      = page_nbr;
    hflash->size       = page_nbr;

    while ((hflash->count > 0U) && (status == HAL_OK))
    {
      tickstart = HAL_GetTick();
      LL_FLASH_StartErasePage(FLASH_GET_INSTANCE(hflash), FLASH_GET_ERASE_BANK(hflash->erase_bank), erase_area, \
                              FLASH_GET_HW_PAGE_INDEX(hflash->erase_page, FLASH_PAGE_NB));

      status = FLASH_WaitForEndOfOperation(hflash, FLASH_ERASE_PAGE_OPERATION_TIMEOUT);

      if (status == HAL_OK)
      {
        hflash->count--;
        if (hflash->count > 0U)
        {
          hflash->erase_page++;

          if (timeout_ms != HAL_MAX_DELAY)
          {
            if (((HAL_GetTick() - tickstart) > timeout_ms) || (timeout_ms == 0U))
            {
              status = HAL_TIMEOUT;
            }
          }
        }
      }
    }

    LL_FLASH_DisablePageErase(FLASH_GET_INSTANCE(hflash));

    hflash->ongoing_operation = HAL_FLASH_NO_OPERATION;
    hflash->global_state = HAL_FLASH_STATE_IDLE;
  }

  return status;
}

/**
  * @brief  Erase pages of FLASH memory by address in interrupt mode.
  * @param  hflash       Pointer to a @ref hal_flash_handle_t structure.
  * @param  bank         Bank to erase.
  *                      This parameter can be one of the following values:
  *                          @arg @ref HAL_FLASH_BANK_1
  *                          @arg @ref HAL_FLASH_BANK_2
  * @param  start_page   Index of the first page to erase.
  * @param  page_nbr     Number of pages to erase.
  * @param  erase_area   Area to erase.
  * @retval HAL_ERROR    Error during erasing.
  * @retval HAL_BUSY     FLASH is busy and cannot start a new erase operation.
  * @retval HAL_OK       No operation to be waiting.
  */
static hal_status_t FLASH_ErasePage_IT(hal_flash_handle_t *hflash,
                                       hal_flash_bank_t bank,
                                       uint32_t start_page,
                                       uint32_t page_nbr,
                                       uint32_t erase_area)
{
  hal_status_t status = FLASH_IsReadyForOperation(hflash);

  if (status == HAL_OK)
  {
    HAL_CHECK_UPDATE_STATE(hflash, global_state, HAL_FLASH_STATE_IDLE, HAL_FLASH_STATE_ACTIVE);

#if defined (USE_HAL_FLASH_GET_LAST_ERRORS) && (USE_HAL_FLASH_GET_LAST_ERRORS == 1)
    hflash->last_error_codes = HAL_FLASH_ERROR_NONE;
#endif /* USE_HAL_FLASH_GET_LAST_ERRORS */

    /* Fill the operation information structure */
    hflash->ongoing_operation = HAL_FLASH_PAGE_ERASE;
    hflash->erase_bank = bank;
    hflash->erase_page = start_page;
    hflash->count      = page_nbr;
    hflash->size       = page_nbr;

    LL_FLASH_ClearFlag_EOP(FLASH_GET_INSTANCE(hflash));
    LL_FLASH_EnableIT(FLASH_GET_INSTANCE(hflash), LL_FLASH_IT_ALL);
    LL_FLASH_StartErasePage(FLASH_GET_INSTANCE(hflash), FLASH_GET_ERASE_BANK(hflash->erase_bank), erase_area, \
                            FLASH_GET_HW_PAGE_INDEX(hflash->erase_page, FLASH_PAGE_NB));
  }

  return status;
}
#endif /* USE_HAL_FLASH_ERASE_PAGE */

#if defined(USE_HAL_FLASH_GET_LAST_ERRORS) && (USE_HAL_FLASH_GET_LAST_ERRORS == 1)
/**
  * @brief  Update last error element of FLASH handle.
  * @param  hflash Pointer to a @ref hal_flash_handle_t structure.
  * @param  flags  Bitfield containing the error flags.
  */
static void FLASH_FillErrorCode(hal_flash_handle_t *hflash, uint32_t flags)
{
  uint32_t error_codes = 0U;

#if defined (USE_HAL_FLASH_PROGRAM_BY_ADDR) && (USE_HAL_FLASH_PROGRAM_BY_ADDR == 1)
  if ((flags & LL_FLASH_FLAG_STRBERR) != 0U)
  {
    error_codes |= HAL_FLASH_ERROR_STRB;
  }

  if ((flags & LL_FLASH_FLAG_INCERR) != 0U)
  {
    error_codes |= HAL_FLASH_ERROR_INC;
  }
#endif /* USE_HAL_FLASH_PROGRAM_BY_ADDR */
#if (defined (USE_HAL_FLASH_PROGRAM_BY_ADDR) && (USE_HAL_FLASH_PROGRAM_BY_ADDR == 1)) \
    || (defined (USE_HAL_FLASH_ERASE_BY_ADDR) && (USE_HAL_FLASH_ERASE_BY_ADDR == 1)) \
    || (defined (USE_HAL_FLASH_ERASE_PAGE) && (USE_HAL_FLASH_ERASE_PAGE == 1)) \
    || (defined (USE_HAL_FLASH_ERASE_BANK) && (USE_HAL_FLASH_ERASE_BANK == 1)) \
    || (defined (USE_HAL_FLASH_MASS_ERASE) && (USE_HAL_FLASH_MASS_ERASE == 1))
  if ((flags & LL_FLASH_FLAG_WRPERR) != 0U)
  {
    error_codes |= HAL_FLASH_ERROR_WRP;
  }
  if ((flags & LL_FLASH_FLAG_PGSERR) != 0U)
  {
    error_codes |= HAL_FLASH_ERROR_PGS;
  }
#endif /* USE_HAL_FLASH_PROGRAM_BY_ADDR || USE_HAL_FLASH_ERASE_BY_ADDR || USE_HAL_FLASH_ERASE_PAGE
          || USE_HAL_FLASH_ERASE_BANK || USE_HAL_FLASH_MASS_ERASE */

  hflash->last_error_codes |= error_codes;
}
#endif /* USE_HAL_FLASH_GET_LAST_ERRORS */

