MaJerle/stm32-usart-uart-dma-rx-tx/drivers/STM32C5xx_drivers/hal/stm32c5xx_hal_flash.c
#if (defined (USE_HAL_FLASH_PROGRAM_BY_ADDR) && (USE_HAL_FLASH_PROGRAM_BY_ADDR == 1)) \
    || (defined (USE_HAL_FLASH_ERASE_BY_ADDR) && (USE_HAL_FLASH_ERASE_BY_ADDR == 1))
/**
  * @brief Get the bank which contains the given flash address.
  * @param hflash Pointer to a @ref hal_flash_handle_t structure.
  * @param flash_addr Flash Address
  * @retval hal_flash_bank_t the bank containing the given address.
  *                    This parameter is one element of @ref hal_flash_bank_t enumeration.
  */
static hal_flash_bank_t FLASH_GetBank(const hal_flash_handle_t *hflash, uint32_t flash_addr)
{
  hal_flash_bank_t low_addr_range_bank, high_addr_range_bank;

  if (LL_FLASH_OB_IsBankSwapped(FLASH_GET_INSTANCE(hflash)) == 0U)
  {
    low_addr_range_bank = HAL_FLASH_BANK_1;
    high_addr_range_bank = HAL_FLASH_BANK_2;
  }
  else
  {
    low_addr_range_bank = HAL_FLASH_BANK_2;
    high_addr_range_bank = HAL_FLASH_BANK_1;
  }

  if (flash_addr < (FLASH_BASE + FLASH_SIZE)) /* Main User Flash*/
  {
    return (((flash_addr - FLASH_BASE) < FLASH_BANK_SIZE) ? low_addr_range_bank : high_addr_range_bank);
  }
  else /* EDATA Flash */
  {
#if defined(USE_HAL_FLASH_OB_EDATA) && (USE_HAL_FLASH_OB_EDATA == 1)
    return (((flash_addr - FLASH_EDATA_BASE) < FLASH_EDATA_BANK_SIZE) ? low_addr_range_bank : high_addr_range_bank);
#else
    return (((flash_addr - FLASH_EXT_USER_BASE) < FLASH_EXT_USER_BANK_SIZE) \
            ? low_addr_range_bank : high_addr_range_bank);
#endif /* USE_HAL_FLASH_OB_EDATA */
  }
}

/**
  * @brief  Check if a FLASH address is part of the user FLASH area.
  * @param  flash_addr The FLASH address to check.
  * @param  check_program_alignment The flag indicating if the address must be aligned for programming.
  * @retval The status of the FLASH address test (1: address is in user FLASH, 0: otherwise)
  */
static uint32_t FLASH_IsFlashUSERAddr(uint32_t flash_addr, uint8_t check_program_alignment)
{
  uint32_t is_user_addr = ((flash_addr >= FLASH_BASE) && (flash_addr < (FLASH_BASE + FLASH_SIZE))) ? 1U : 0U;

#if !defined(USE_HAL_FLASH_OB_EDATA) || (USE_HAL_FLASH_OB_EDATA == 0)
  is_user_addr = ((is_user_addr != 0U) \
                  || ((flash_addr >= FLASH_EXT_USER_BASE) \
                      && (flash_addr < (FLASH_EXT_USER_BASE + FLASH_EXT_USER_SIZE)))) ? 1U : 0U;
#endif /* !USE_HAL_FLASH_OB_EDATA */
  return (((is_user_addr != 0U) && ((check_program_alignment == 0U) ? (1U == 1U) : (((flash_addr) % 16U) == 0U))) \
          ? 1U : 0U);
}

#if defined(USE_HAL_FLASH_OB_EDATA) && (USE_HAL_FLASH_OB_EDATA == 1) \
    && (defined(USE_ASSERT_DBG_PARAM) || (defined(USE_HAL_CHECK_PARAM) && (USE_HAL_CHECK_PARAM == 1)))
/**
  * @brief  Check if a FLASH address is part of the EDATA FLASH area.
  * @param  flash_addr The FLASH address to check.
  * @param  check_program_alignment The flag indicating if the address must be aligned for programming.
  * @retval The status of the FLASH address test (1: address is in EDATA FLASH, 0: otherwise)
  */
static uint32_t FLASH_IsFlashEDATAAddr(uint32_t flash_addr, uint8_t check_program_alignment)
{
  return (((flash_addr >= FLASH_EDATA_BASE) && (flash_addr < (FLASH_EDATA_BASE + FLASH_EDATA_SIZE)) \
           && (check_program_alignment == 0U)) || ((flash_addr & 1U) == 0U)) ? 1U : 0U;
}
#endif /* USE_HAL_FLASH_OB_EDATA && (USE_ASSERT_DBG_PARAM || (USE_HAL_CHECK_PARAM)) */
#endif /* USE_HAL_FLASH_PROGRAM_BY_ADDR || USE_HAL_FLASH_ERASE_BY_ADDR */

#if (defined (USE_HAL_FLASH_PROGRAM_BY_ADDR) && (USE_HAL_FLASH_PROGRAM_BY_ADDR == 1)) \
    || (defined (USE_HAL_FLASH_ERASE_BY_ADDR) && (USE_HAL_FLASH_ERASE_BY_ADDR == 1)) \
    || (defined (USE_HAL_FLASH_ERASE_PAGE) && (USE_HAL_FLASH_ERASE_PAGE == 1)) \
    || (defined (USE_HAL_FLASH_ERASE_BANK) && (USE_HAL_FLASH_ERASE_BANK == 1)) \
    || (defined (USE_HAL_FLASH_MASS_ERASE) && (USE_HAL_FLASH_MASS_ERASE == 1))
/**
  * @brief  Handle the FLASH error interrupt.
  * @param  hflash Pointer to a @ref hal_flash_handle_t structure.
  * @param  bank   Bank where the error occurred.
  *                This parameter can be one element of the @ref hal_flash_bank_t enumeration.
  */
static void FLASH_HandleErrorIT(hal_flash_handle_t *hflash, hal_flash_bank_t bank)
{
  LL_FLASH_DisableAllOperation(FLASH_GET_INSTANCE(hflash));

  LL_FLASH_DisableIT(FLASH_GET_INSTANCE(hflash), LL_FLASH_IT_ALL);

  LL_FLASH_ClearFlag(FLASH_GET_INSTANCE(hflash), LL_FLASH_FLAG_ERRORS_ALL);

  hflash->global_state = HAL_FLASH_STATE_IDLE;

  hflash->ongoing_operation = HAL_FLASH_NO_OPERATION;

#if defined (USE_HAL_FLASH_REGISTER_CALLBACKS) && (USE_HAL_FLASH_REGISTER_CALLBACKS == 1)
  hflash->p_error_cb(hflash, bank);
#else
  HAL_FLASH_ErrorCallback(hflash, bank);
#endif /* USE_HAL_FLASH_REGISTER_CALLBACKS */
}
#endif /* USE_HAL_FLASH_PROGRAM_BY_ADDR || USE_HAL_FLASH_ERASE_BY_ADDR || USE_HAL_FLASH_ERASE_PAGE
          || USE_HAL_FLASH_ERASE_BANK || USE_HAL_FLASH_MASS_ERASE */

/**
  * @}
  */

/**
  * @}
  */

#endif /* USE_HAL_FLASH_MODULE */
#endif /* FLASH */

/**
  * @}
  */
